/**
 *  initial comments.
 */
/*******************************************************************************
 * Copyright 2013 PKP
 * 
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 * 
 *    http://www.apache.org/licenses/LICENSE-2.0
 * 
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 * 
 * PROJECT NAME	: pkp-changing
 * 
 * FILE PATH        	: src/main/java/com/deppon/foss/module/pickup/changing/client/action/WaybillImportAction.java
 * 
 * FILE NAME        	: WaybillImportAction.java
 * 
 * AUTHOR			: FOSS接送货系统开发组
 * 
 * HOME PAGE		: http://www.deppon.com
 * 
 * COPYRIGHT		: Copyright (c) 2012  Deppon All Rights Reserved.
 ******************************************************************************/
/*
 * Copyright by Deppon and the original author or authors.
 * 
 * This document only allow internal use ,Any of your behaviors using the file
 * not internal will pay legal responsibility.
 *
 * You may learn more information about Deppon from
 *
 *      http://www.deppon.com
 *
 */

/**
 * 1.5.3	界面描述
主界面标题：变更运单。
“变更运单”主界面包含变更基本条件录入区域、
运单信息显示及编辑区域、功能按钮区域。
起草变更单（内部）操作：用户进入“变更运单”主界面后
（见起草变更单（内部）界面-1），
导入运单信息至操作界面，
选择运单变更为“内部要求”，
录入变更原因并修改运单信息，
最终上传变更凭证提交运单变更申请。
1.变更基本条件录入区域：
1）单号：起草运单变更对应的运单号。
2）客户要求：
由于客户原因发起的运单变更需求；
3）内部要求：
由于内部操作失误发起的运单变更需求；
4）变更类型：
客户要求的运单变更包含转运、返货、更改、作废，
内部要求的变更包含更改、中止。
5）变更原因：
起草变更运单的原因。
2.运单信息显示及编辑区域：
1）运单基础信息：
包含收货部门、变更单号、上门接货。
2）发货客户信息：
包含发货人手机、电话、客户名称、联系人、地址。
3）收货客户信息：
包含收货人手机、电话、联系人、地址。
4）运输信息：
包含货物状态、提货方式、目的站、提货网点、
运输性质、配载类型、预配航班、
返单类别、对外备注、对内备注。
5）货物信息：货物的基本信息，
包含货物名称、包装、件数、重量、尺寸、
体积、货物类型、大车直送、
贵重物品、特殊物品。
5）增值业务信息：包含保价声明价值、代收货款、
退款类型、收款人、收款账号、包装费、
送货费、装卸费、其他费用项。
6）计费付款信息：包含公布价运费、
增值服务费、优惠费用、费用合计、
付款方式、到付金额、现付金额、
预付费保密。
7）详细计价信息：默认隐藏不显示，
点击向左伸展按钮后伸展显示（见起草变更单
（内部）界面-2）。包含计费类型、计费重量、
费率、运费、保价声明价值、保价费率、保价费、
代收货款、代收费率、代收手续费、包装费、
送货费、其他费用、优惠费用、费用合计。
8）变更信息：变更运单条目明细显示。
该区域主要显示变更的项目及变更前后对应的运单信息。
9）上传凭证区域：
上传变更凭证电子件。
3.功能按钮：
导入：点击导入按钮将运单号对应的运单信息展现在变更运单界面。
提交：点击提交变更运单申请。
打印：提交运单变更后，可点击打印变更单。
1.6	操作步骤
序号	基本步骤	相关数据	补充步骤
1	点击变更运单菜单进入“变更运单”主界面		系统初始化界面控件值
2	输入运单号，点击“导入”按钮	运单信息	系统判断是否允许发起运单变更：1）若允许，则系统搜索运单信息并根据数据元素的对应关系将运单信息带至变更运单界面相应控件，参见业务规则SR1；
2）若不允许，则系统弹出提示框给予相应提示。参见业务规则SR2
3	点击“内部要求”单选按钮 		1.	运单项对应的编辑状态发生变化，参见业务规则SR3；
2.	上传凭证区域显示默认上传的变更凭证名称，参见业务规则SR4。
4	用户在“变更原因“输入框内输入内部申请变更运单的原因	变更运单原因	
5	用户在运单信息显示区域修改相应的运单信息		“变更信息”区域显示变更项及其变更前后对应的运单信息，参见业务规则SR5
6	点击变更凭证所在行的“上传”按钮 	变更凭证电子件	弹出【路径选择】模式窗口，参见业务规则SR10
7	选择凭证存放的本地路径，点击“确定”按钮		凭证上传至变更界面
8	点击“提交”按钮		弹出【运单变更信息】对话框，回显运单变更的信息，参见系统用例SUC-490：显示运单变更明细
9	点击对话框界面的“确定”按钮		系统弹出对话框提示是否确定提交运单变更申请。
10	点击“确定”按钮，确定提交运单变更申请		系统校验是否满足运单变更申请的条件，参见业务规则SR2、SR8
1.	若满足则系统提示运单变更申请成功，同时
1）系统根据凭证存放路径找到凭证文件后保存到系统中；
2）“打印”按钮变为可点击。
2.	若不满足则系统给予提示。

扩展事件

序号	扩展事件	相关数据	备注
2a	输入运单号，点击“导入”按钮后，
若未找到对应的运单信息，系统给以提示		
2b	运单信息导入变更运单界面相应控件后，
若再次点击“导入”按钮还原当前运单信息		
7a	用户可以点击变更凭证所在行“删除”按钮删除已上传的凭证，
重新选择文件上传	变更凭证电子件	
7b	用户可以点击变更凭证所在行“查看”按钮查看已上传的凭证	
变更凭证电子件	
8a	若未对运单信息做任何修改，
提交时系统给予提示不能提交		
9a	点击对话框界面的“取消”按钮		
取消运单变更申请，返回运单变更主界面
10a	点击对话框界面的“取消”按钮		
取消运单变更申请，返回运单变更主界面
1.7	业务规则
序号	描述
SR1	1.  由于整车运单信息与非整车运单信息不同，
导入整车运单至变更运单界面后，
整车运单信息中不存在的字段控件值为空，不可编辑。
2.  如导入的运单为整车运单，
则运输性质控件显示为“整车”。
SR2	
下表为不能起草运单变更的类型及不能起草时系统提示内容

序号	不能起草运单变更的类型	提示内容
1	运单状态为“已保存待补录”的运单	
运单未补录，不能起草运单变更！
2	运单状态为“作废”、“中止”的运单	
运单已作废，不能起草运单变更！
运单已中止，不能起草运单变更！
3	运单对应的收货部门与系统当前组织不一致	该单的收货部门不是您部门，
不能起草运单变更！
4	运单状态为“已签收”的运单	货物已签收，
不能起草运单变更！
5	变更单状态为“待审核”或“待受理”的运单	
该运单有运单变更单还未被审核，不能起草变更运单！
该运单有运单变更单还未被受理，不能起草变更运单！
6	运单已进行结清货款操作	该运单已进行结清货款操作，
如需更改请联系到达部门进行反结清货款操作！
7	财务锁定的运单（财务将不允许发起变更的运单进行锁定）
不能发起运单变更 
该运单已被财务锁定，
不能起草变更运单！


SR3	1．	运单无出库记录，
不允许起草转运单、返货单；
a.	客户来源可以选择更改、作废；
b.	内部来源可以选择更改、中止
2．	运单出库记录，不允许起草作废单，
涉及到目的站、提货网点的修改必须到转运信息、
返货信息面板修改；如果变更提货方式，
由“派送”该为“自提”，原始目的站不支持“自提”，
提示“原始目的站不支持自提，请选择转运或返货类型”
a.	客户来源可以选择更改、转运、返货；
c.	内部来源可以选择更改、中止
3．	若未选择变更要求（客户要求/内部要求），
运单信息显示区域的控件为不可编辑状态；
若选择了变更要求，
则不可变更的运单项对应的控件为不可编辑状态，
可以变更的运单项对应的控件为可编辑状态。
运单项能否进行变更主要受变更要求、
运输类型、货物当前库存部门三个维度的影响。
其中内部要求发起的运单变更，
可变更及不可变更的运单项请详见下表：
     

SR4	1.	选择客户要求变更时，
上传凭证名称默认显示为“身份证复印件”及“运单客户联”，
可另新增变更凭证；选择内部要求变更时，
上传凭证名称默认显示为“运单原件”，
可另新增变更凭证；
2.	默认显示的变更凭证所在行不可删除，
新增的变更凭证所在行可删除；
3.	已选择上传的变更凭证可点击查看，
也可点击删除。
SR5	1.	 “变更项”列显示为变更的运单项名称，
“变更前信息”列显示变更项在变更前对应的运单信息，
“变更后信息”列显示变更项在变更后对应的运单信息。
如是转运或返货变更：“目的站”变更项对应的变更前信息为原目的站，
变更后信息为转运/返货目的站；
“提货网点”变更项对应的变更前信息为原提货网点，
变更后信息为转运/返货提货网点。
2.	对于“上门接货”、“预付费保密”、“大车直送”、
“贵重物品”、“特殊物品”为复选框的变更项，
变更前后对应的信息根据复选框勾选与否显示为是或否；
3.	若变更项变更前信息或变更后信息为空，
则“变更前信息”或“变更后信息”列显示为:—；
4.	以下运单项不列入变更项：计费类型、
计费重量、费率、保价费率、代收费率、装卸费、
其他费用（总金额）、转运运输性质、转运配载类型、
转运预配航班、转运计费类型、转运费率、
返货运输性质、返货计费类型；
5.	变更项行显示顺序为：运单基础信息变更项→
发货客户信息变更项→收货客户信息变更项→运输信息变更项→
货物信息变更项→增值业务信息变更项→详细计价信息变更项→计费付款信息变更项；
6.	“变更前信息”与“变更后信息”列显示内容不能相同。
SR6	1.	运单信息的修改录入操作参照运单生成相关系统用例的操作；
2.	修改运单信息时，
系统校验的业务规则参照运单生成相关系统用例的业务规则。
SR7	1.	关键增值服务信息的变更规则：

运单项	起草运单变更时对应的版本
费率	产品在运单信息生成时对应的公布价版本
保价费率	运单信息生成时的保价费率版本
代收费率	运单信息生成时的代收费率版本
公布价运费	运单信息生成时的公布价运费版本
保价费	运单信息生成时对应的收费标准
代收手续费	运单信息生成时对应的收费标准
送货费	运单信息生成时对应的收费标准
装卸费	运单信息生成时对应的收费标准
其他费用项	运单信息生成时的收费标准
优惠费用	运单开单信息生成时对应的优惠标准

综上：起草变更单（内部）时，产品及价格优惠版本统一执行运单开单时对应的版本。
举例：
公布价运费：运单开单时精准卡航对应的公布价（上门发货）运费最低一票为40元，在开单后系统维护调整为50元最低一票。则在起草变更单时，最低一票仍执行运单开单时的标准，即为40元一票。
2.	含有代收货款的运单，如取消代收货款（代收货款金额更改为0），代收手续费变为0。
SR8	提交变更运单时必须已上传变更凭证，否则不能提交
SR9	成功提交运单变更后，方可打印变更单
SR10	1.	弹出路径选择框，
默认指定路径在桌面，可选择保存路径；
2.	可上传的凭证扫描件，应该为图片，格式允许选择常见的JPG,GIF,PNG,BPM；
3.	上传图片大小有所限制（默认250K，允许系统后台配置），
如果超出所设范围，系统给出提示“您上传的文件已超过最大允许大小250K，请调整后重新上传。”。
SR11	对于发货客户的变更：
1.	同一发货客户，若客户资质发生变化；
a)	开单时为合同客户，开单后（起草更改单之前）
客户属性变为非合同客户： FOSS在开单时记录客户资质，起草更改单时仍可选择免费送货；
b)	开单时为非合同客户，开单后（起草更改单之前）
客户属性升级为合同客户：起草更改单时仍可选择免费送货；
2.	由某一发货客户更改为另一发货客户
a)	合同客户更改为非合同客户：原开单提货方式为免费送货，
与开单时保持一致，即直接清空提货方式，重新选择提货方式;
b)	非合同客户更改为合同客户：提货方式中增加"免费送货"选项。
SR12	1.	货物未到达第一打木架外场（开单录入代打木架信息时系统自动生成的代打木架信息），
允许修改代打包装信息
2.	货物已到达第一打木架外场，则不可发起代打包装信息更改
3.	若有代打包装，则在录入代打包装信息后，
系统自动计划出代打包装费用，显示至包装费中，
营业员或开单员可以任意修改包装费。
4.	在更改单界面中，加入代打包装货物件数的选择，
即流水号选择。在发起代打包装更改单时，
打开的代打包装信息中默认勾选开单录入的代装包装总件数的流水号，
即：开单录入代打木架4件，代打木箱3件，
则在更改单代打包装信息中，自勾选流水号1-7；
5.	允许点击“代打木架”按钮直接修改打包装信息
1.8	数据元素
1.8.1	变更基本录入信息
字段名称 	说明 	输入限制	输入项提示文本	长度	是否必填	备注
客户要求	客户提出的运单变更申请	单选框		10	是	默认为空
内部要求	由于内部开单失误而提出的运单变更申请	单选框		10	是	默认为空
变更类型	变更运单的类型，客户要求下包含：转运、返货、作废、更改，内部要求下包含更改、中止。	下拉框		10	是	默认为“更改”
变更原因	变更运单的原因	文本		80	是	默认为空
1.8.2	运单基础信息
字段名称 	说明 	输入限制	输入项提示文本	长度	是否必填	备注
收货部门	收取货物的部门				是	
变更单号	点击可变更运单单号	复选框			否	
可勾选时，则勾选后显示变更单号文本框（可编辑）
上门接货	前往客户处接收货物	复选框			否	

1.8.3	发货客户信息
字段名称 	说明 	输入限制	输入项提示文本	长度	是否必填	备注
手机	发货联系人的手机号码	文本			否	导入运单信息
电话	发货联系人的电话号码	文本			否	导入运单信息
客户名称	发货企业客户的公司名，个人客户的姓名	公共选择框			是	导入运单信息
联系人	发货客户的个人代表	文本			是	导入运单信息
地址	发货客户的联系地址	文本			否	导入运单信息
1.8.4	收货客户信息
字段名称 	说明 	输入限制	输入项提示文本	长度	是否必填	备注
手机	收货联系人的手机号码	文本			否	
电话	收货联系人的电话号码	文本			否	
联系人	收货客户的个人代表	文本			是	
地址	收货客户的联系地址	文本			否	提货方式为送货时必填
1.8.5	运输信息
字段名称 	说明 	输入限制	输入项提示文本	长度	是否必填	备注
货物状态	货物当前状态，包含：收货部门库存中、
收货部门已出库（已出收货部门库存，中转部门未入库）、
中转部门库存中、中转部门已出库（已出中转部门库存，即货物在途运输）、
到达部门库存中、到达部门送货中。	文本			是	系统自动带出数据
注：分批配载的货物，以距离最终配载部门最近的部门作为参照。
提货方式	货物提取方式	下拉框			是	
目的站	货物的目的站	文本			是	
提货网点	货物的提货网点	公共选择框			是	
运输性质	货物的运输性质	下拉框			是	
配载类型	货物的配载类型	下拉框			是	由运输性质决定
预配航班	空运班次，含早班、中班、晚班	下拉框			是	
返单类别	签收单返回类型，含签收单原件返回、传真返回、扫描上传、无需返回	下拉框			是	
对外备注	传达给客户的备注信息	下拉框				可选择多项
对内备注	公司内部备注信息	文本			是	
1.8.6	货物信息
字段名称 	说明 	输入限制	输入项提示文本	长度	是否必填	备注
名称	货物的名称	文本			是	
包装	货物的外包装	文本			是	
件数	货物的件数	文本			是	
重量	货物的重量	文本			是	
尺寸	货物的尺寸	文本			否	
体积	货物的体积	文本			是	
货物类型	货物的A/B类型，区分大小货	单选按钮			否	
大车直送		复选框			否	
贵重物品		复选框			否	
特殊物品		复选框			否	
1.8.7	增值业务信息
字段名称 	说明 	输入限制	输入项提示文本	长度	是否必填	备注
保价声明价值	货物保价金额	文本		8	是	
代收货款	代收货款金额	文本		8	是	
退款类型	代收货款退款方式	下拉框			否	
收款人	代收货款收款人	文本			否	
收款账号	收款人银行账号	文本			否	
包装费	货物包装费用	文本			是	若无则输入0
送货费	货物送货费用	文本			是	若无则输入0
装卸费	装卸费用	文本			是	若无则输入0
1.8.8	计费付款信息
字段名称 	说明 	输入限制	输入项提示文本	长度	是否必填	备注
公布价运费	根据公布价计算的运费				是	公布价运费=运费+转运费或返货费
增值服务费	增值服务费用总计				是	
优惠费用	优惠打折的总费用				是	
费用合计	向客户收取的费用总计				是	
付款方式	承运费用付款的方式	下拉框			是	
到付金额	收货客户需要支付的费用	文本			是	若无则输入0
现付金额	发货客户需要支付的费用	文本			是	若无则输入0
预付费保密	对预付费用进行保密	复选框			否	
1.8.9	变更信息
字段名称 	说明 	输入限制	输入项提示文本	长度	是否必填	备注
变更项	运单信息发生变更的项目				是	系统根据更改项自动生成显示
变更前信息	变更项变更前对应的运单信息				是	系统自动生成
变更后信息	变更项变更后对应的运单信息				是	系统自动生成
1.8.10	详细计价信息
字段名称 	说明 	输入限制	输入项提示文本	长度	是否必填	备注
计费类型	分为重量计费、体积计费两种				是	系统自动生成
计费重量	空运时为必填项，汽运时不可编辑				否	系统自动计算生成
费率					是	
保价费率					是	
代收费率					是	
运费					是	
保价费					是	
代收手续费					是	
包装费					是	
送货费					是	
其他费用					是	
优惠费用					是	
费用合计					是	
1.9	非功能性需求
使用量	每天处理的运单约为1000000单，变更运单的数量占比约为20%
2012年全网估计用户数	营业员数量约10000名
响应要求（如果与全系统要求 不一致的话）	系统一般需求
使用时间段	营业部上班时间
高峰使用时间段	9:00-16:00，19:00-21:00
1.10	接口描述：
接口名称 	对方系统（外部系统或内部其他模块）	接口描述
客户信息接口	CRM系统	FOSS调用CRM客户信息接口，查询录入客户信息
电子地图接口	GIS系统	FOSS调用电子地图接口查询录入目的站、提货网点信息
库存接口	中转子系统	FOSS调用中转库存接口判断货物是否已签收出库
财务类变更接口	结算系统	FOSS调用该接口判断财务是否可发起财务类变更，
若财务对运单进行了锁定，则不可发起财务类变更


 */
/**--------------------------------------
 * 1.	纸包装件数默认显示数值等于货物总件数，
 * 营业员可以修改各包装的件数；
 * 系统自动在录入下一个包装前计算显示剩余未录入的件数，
 * 例：某票货物为50件，则自动显示纸包装50，
 * 在营业员修改纸包装为20时，木包装自动显示为30，
 * 在营业员修改木包装为10时，
 * 纤包装自动显示为20，该过程中未录入包装数值的默认显示为0；
2.	货物包装总件数小于等于货物总件数；
 */
/**--------------------------------------
 * 1.	离线开单时，不录入代打木架信息；
 * 当木包装件数大于等于1时，系统不提示任何信息，
 * 也不弹出代打木架录入界面；
2.	离线开单的代打木架信息在离线开单提交时，
系统校验提醒；
 */
/**
 * 1.	运输类型为汽运时，货物类型为唯一选择项；即，
 * 非A即B；默认不可勾选，
 * 只有当走货路由经过特定的城市时需要录入货物类型,
 * 特定城市可在系统中进行配置；
2.	运输类型为空
默认显示为普货，目前只有这一个分类，该类型可做配置；
--------------------------------------
 */
/**--------------------------------------
 * 1.	系统根据货物名称匹配生成的勾选贵重物品，
 * 营业员不可去掉勾选；
2.	营业员也可以主动勾选贵重物品；
3.	件数等于1、体积小于等于0.05个方、
报价声明价值大于等于10000元，为贵重物品；
系统自动勾选贵重物品，
营业员可修改是否勾选；
4.	件数大于等于2时，平均体积（体积/件数）
小于等于0.5方，平均声明价值（保价声明价值/件数）
大于等于10000元，为贵重物品；
系统自动勾选贵重物品，
营业员可修改是否勾选；
1.	营业部开单时按打完木架后的包装开，
即包装中含“木架/木箱”，
开单件数为货物打木架/木箱前的实际件数（防止丢货），
尺寸和重量按照以下公式计算：
1.1	整票货物代打时：
开单体积=代打货物体积*1.4；
开单重量=所有货物重量+代打货物体积*42；
1.2	部分货物代打时，
开单体积=代打货物体积*1.4+未打木架货物体积；
开单重量=所有货物重量+代打货物体积*42。
即：营业部按照代打货物未打木架之前体积的1.4倍来开单收费，
重量另加，单票中未打木架的货物的体积和重量不变；
1.3	例如：一票货物需全部代打，
货物体积为1个方，重量为100KG，
则开单体积为1.4个方，
开单重量为100+1*42=142KG，
收取客户包装费为150*1.4=210元；
1.4	需要加托时，仍按照50元/个另外收取费用，
托的重量和体积不再另加；
营业部不需要再更改由于打木架引起重量和体积的变化；
2.	开单件数为代打木架前货物实际件数，
包装为打木架后的包装，
打木架后件数发生变化后，
需及时更改件数；
--------------------------------------
 */

/**--------------------------------------
 * 每天处理的运单约为1000000单
营业员数量约10000名
系统一般要求
营业部、集中开单小组上班时间
营业部：16：00-20：00
集中开单小组：21：00-次日4：00
 */

/**--------------------------------------
 * 本界面为录入增值服务信息。
界面主要分为三个部分：
录入增值服务、
录入包装费、
查询其它费用。
1.	录入增值服务
录入增值服务分为两个部分：
录入增值服务信息界面、
录入其它费用列表；
1.1	录入增值服务信息界面
录入增值服务信息界面包括：
1.1.1	保价声明价值；
1.1.2	保价费率：
保价费率可由基础资料配置，
可按出发城市区域，
出发营业部等；
1.1.3	保价费；
1.1.4	代收货款；
1.1.5	代收费率；
1.1.6	代收手续费；
1.1.7	退款类型：
包括三日退、
退日退、
审核退，
默认三日退；
1.1.8	包装费；
1.1.9	装卸费；
1.1.10	送货费；
1.1.11	其它费用合计；
1.1.12	返单类别：
包括无需返单、
原件签收单返回、
传真件签收单返回、
扫描件返回，
默认无需返单；
1.1.13	预付费保密；
1.2	录入其它费用列表
录入其它费用列表包括：
1.2.1	费用名称；
1.2.2	费用金额；
1.2.3	新增其它费用：
功能按钮；
1.2.4	删除其它费用：
功能按钮；
2.	录入包装费
其界面和界面和需求详见系统用例“DP-FOSS-接送货系统用例-运单生成-确认承运信息-录入增值服务信息”中“录入包装费”；
3.	查询其它费用
其界面和界面和需求详见系统用例“DP-FOSS-接送货系统用例-运单生成-确认承运信息-录入增值服务信息”中“查询其它费用”；
--------------------------------------
 */
/**
 * /**--------------------------------------
 * 1.	若货物为违禁品，
 * 	则系统自动提示“货物为违禁品，不可开单！”；
 2.	若货物为拒收品，
 则系统自动提示“货物为拒收品，不可开单！”；
 3.	若货物为贵重物品，
 则系统自动勾选“贵重物品”，
 且不可修改；
 4.	若货物为限保物品，
 则系统自动限定保价金额，且不可修改，
 并提示“货物为限保物品”；
 5.	违禁品、拒收品、
 贵重物品、限保物品（含保价金额上限）
 具体类型可在系统中进行配置；
 1.	货物重量单位为千克
 */
/**--------------------------------------
 * 1.	货物尺寸为计算器输入，
 * 显示为输入文本；
2.	尺寸计算单位为厘米，
尺寸计算出数据后转换单位为立方米后，
在货物体积中显示数据；例如：
尺寸录入为：50*50*20，
则体积显示数据为：0.05；
 */
/**--------------------------------------
 * 1.	货物体积单位为立方米；
2.	营业员可以修改通过尺寸计算器
计算得出的体积数据；
3.	系统设置货物重量体积比区间值（该值由基础资料配置），
在运单提交时，
系统自动对重量体积比进行校验：
即重量体积比X=重量/体积；
3.1	当X不在设置的区间中，
弹出提示“请确认录入的重量体积是否准确！”；
（该弹窗有两个按钮：确定、取消）点击确定时，
弹出离线开单确认运单信息界面；点击取消，
点返回运单录入界面；
3.2	当X在区间中，无提示；
直接进入确认运单信息界面；
--------------------------------------
 */
/**--------------------------------------
 * 1.	纸包装件数默认显示数值等于货物总件数，
 * 营业员可以修改各包装的件数；
 * 系统自动在录入下一个包装前计算显示剩余未录入的件数，
 * 例：某票货物为50件，则自动显示纸包装50，
 * 在营业员修改纸包装为20时，木包装自动显示为30，
 * 在营业员修改木包装为10时，
 * 纤包装自动显示为20，该过程中未录入包装数值的默认显示为0；
2.	货物包装总件数小于等于货物总件数；
 */
/**--------------------------------------
 * 1.	离线开单时，不录入代打木架信息；
 * 当木包装件数大于等于1时，系统不提示任何信息，
 * 也不弹出代打木架录入界面；
2.	离线开单的代打木架信息在离线开单提交时，
系统校验提醒；
 */
/**
 * 1.	运输类型为汽运时，货物类型为唯一选择项；即，
 * 非A即B；默认不可勾选，
 * 只有当走货路由经过特定的城市时需要录入货物类型,
 * 特定城市可在系统中进行配置；
2.	运输类型为空
默认显示为普货，目前只有这一个分类，该类型可做配置；
--------------------------------------
 */
/**--------------------------------------
 * 1.	系统根据货物名称匹配生成的勾选贵重物品，
 * 营业员不可去掉勾选；
2.	营业员也可以主动勾选贵重物品；
3.	件数等于1、体积小于等于0.05个方、
报价声明价值大于等于10000元，为贵重物品；
系统自动勾选贵重物品，
营业员可修改是否勾选；
4.	件数大于等于2时，平均体积（体积/件数）
小于等于0.5方，平均声明价值（保价声明价值/件数）
大于等于10000元，为贵重物品；
系统自动勾选贵重物品，
营业员可修改是否勾选；
1.	营业部开单时按打完木架后的包装开，
即包装中含“木架/木箱”，
开单件数为货物打木架/木箱前的实际件数（防止丢货），
尺寸和重量按照以下公式计算：
1.1	整票货物代打时：
开单体积=代打货物体积*1.4；
开单重量=所有货物重量+代打货物体积*42；
1.2	部分货物代打时，
开单体积=代打货物体积*1.4+未打木架货物体积；
开单重量=所有货物重量+代打货物体积*42。
即：营业部按照代打货物未打木架之前体积的1.4倍来开单收费，
重量另加，单票中未打木架的货物的体积和重量不变；
1.3	例如：一票货物需全部代打，
货物体积为1个方，重量为100KG，
则开单体积为1.4个方，
开单重量为100+1*42=142KG，
收取客户包装费为150*1.4=210元；
1.4	需要加托时，仍按照50元/个另外收取费用，
托的重量和体积不再另加；
营业部不需要再更改由于打木架引起重量和体积的变化；
2.	开单件数为代打木架前货物实际件数，
包装为打木架后的包装，
打木架后件数发生变化后，
需及时更改件数；
--------------------------------------
 */

/**--------------------------------------
 * 每天处理的运单约为1000000单
营业员数量约10000名
系统一般要求
营业部、集中开单小组上班时间
营业部：16：00-20：00
集中开单小组：21：00-次日4：00
 */

/**
 * 修订记录 
日期 	修订内容 	修订人员 	版本号 
2012-06-18	初版	于红浩	V0.1
2012-7-4	1.	提交运单变更时，增加运单变更信息回显；
2.	删除运单变更预览；
3.	运单提交后才可进行打印；	于红浩	V0.2
2012-7-25	业务评审完毕，升至0.9版本	于红浩	V0.9
2012-8-8	基线	于红浩	V1.0
2012-10-11	1.	删除“待确认的运单变更不能起草运单变更”，增加货款结清的运单不能起草变更单，优化起草运单变更时系统提示内容；
2.	优化内部原因-运单变更规则；
1.	提交界面增加短信通知“发货人”、“收货人”选择框	邵宏亮	V1.01
2012-10-16	1.	补充凭证上传的文件类型为图片，并限制文件大小	邵宏亮	V1.02
2012-12-3	1.	新增变更类型的显示规则，区分作废、转运、返货场景下修改提货网点的方式；
2.	新增合同客户修改规则	邵宏亮	V1.03
2012-12-10	1.	新增代打木架变更处理规则	邵宏亮	V1.04
2013-1-22	2.	添加起草变更规则，去除凭证强制上传限制	邵宏亮	V1.05
2013-2-27		根据ISSUE—1706修订	王辉	
2013-3-6	根据ISSUE-1511修订	王辉	
2013-3-8	根据ISSUE-1878修订	王辉	
1.	SUC-546-起草转运单_返货单
1.1	相关业务用例
BUC_FOSS_5.60.10_745处理返货转货。
1.2	用例描述
对于客户提出的货物转运或返回申请，营业员导入运单信息至运单变更界面后，录入转运/返货的目的站、提货网点等信息（如客户有要求也可同时对运单的其他信息进行更改），最终上传变更凭证并提交变更申请。
注：变更运单包含：起草变更单（外部）、起草变更单（内部）、起草转运单、起草返货单、作废运单、中止运单。
1.3	用例条件
条件类型	描述	引用系统用例
前置条件	1.	系统已生成完整的运单信息	1.	SUC-439：提交运单
2.	SUC-491：补录运单
后置条件	1.	对转运单/返货单变更申请进行审核	1.	SUC-542：查询_审核变更申请
1.4	操作用户角色
操作用户	描述
运单变更起草员	起草转运单/返货单变更申请、上传变更凭证、提交变更申请
1.5	界面要求
1.5.1	表现方式
Web页面 
1.5.2	界面原型
 
【起草转运单】初始界面
 
【起草转运单-录入转运信息】界面
 
【起草转运单-查看转运记录】界面

 
【转运信息回显】界面
 
【起草返货单】初始界面
 
【起草返货单-录入返货信息】界面
 
【起草返货单-查看返货记录】界面


 【返货信息回显】界面
1.5.3	界面描述
主界面标题：变更运单。
“变更运单”主界面包含变更基本条件录入区域、运单信息显示及编辑区域、功能按钮区域。
起草转运单/返货单操作：用户进入“变更运单”主界面后，
导入运单信息至操作界面，选择运单变更为“客户要求”，
选择变更类型为转运/返货后（见【起草转运单】初始界面、
【起草返货单】初始界面），录入变更原因、转运/返货目的站、转运/返货提货网点，
最终上传变更凭证提交转运单/返货单申请。
1.变更基本条件录入区域：
1）单号，起草转运单/返货单对应的运单号。
2）客户要求：由于客户原因发起的运单变更需求；
3）内部要求：由于内部操作失误发起的运单变更需求；
4）变更类型：客户要求的运单变更包含转运、返货、更改、作废，内部要求的变更包含更改、中止。
5）变更原因：变更运单的原因。
2.运单信息显示及编辑区域：
1）运单基础信息：包含收货部门、变更单号、上门接货。
2）发货客户信息：包含发货人手机、电话、客户名称、联系人、地址。
3）收货客户信息：包含收货人手机、电话、联系人、地址。
4）运输信息区域：当选择变更类型为“转运”或“返货”时，该区域以table页签形式展现。
ⅰ当选择变更类型为“转运”时，
该区域包含【运输信息】及【转运信息】两个页签（如有转运或返货更改记录，
还需显示【转运记录】或【返货记录】页签）。
ⅱ当选择变更类型为“返货”时，
该区域包含【运输信息】及【返货信息】两个页签（如有转运或返货更改记录，
还需显示【转运记录】或【返货记录】页签）。
运输信息：包含货物状态、提货方式、目的站、提货网点、
运输性质、配载类型、预配航班、返单类别、对外备注、对内备注。
转运信息：包含转运目的站、转运提货网点、转运运输性质、
转运配载类型、转运预配航班、转运计费类型、转运费率、转运费。
返货信息：包含返货目的站、返货提货网点、
返货运输性质、返货计费类型、返货费率、返货费。
5）货物信息：货物的基本信息，包含货物名称、包装、
件数、重量、尺寸、体积、货物类型、大车直送、
贵重物品、特殊物品。
5）增值业务信息：包含保价声明价值、代收货款、
退款类型、收款人、收款账号、包装费、送货费、装卸费、其他费用项。
6）计费付款信息：包含公布价运费、增值服务费、
优惠费用、费用合计、付款方式、到付金额、
现付金额、预付费保密。
7）详细计价信息：默认隐藏不显示，
点击向左伸展按钮后伸展显示。包含计费类型、计费重量、费率、运费、
保价声明价值、保价费率、保价费、代收货款、代收费率、
代收手续费、包装费、送货费、其他费用、优惠费用、合计。
8）变更信息：变更运单条目明细显示。
该区域主要显示变更的项目及变更前后对应的运单信息。
3.功能按钮：
导入：点击导入按钮将运单号对应的运单信息展现在变更运单界面。
提交：点击提交变更运单申请。
打印：提交运单变更后，可点击打印转运单/返货单。
1.6	操作步骤
1.6.1	起草转运单操作步骤

序号	基本步骤	相关数据	补充步骤
1	点击变更运单菜单进入“变更运单”主界面		
系统初始化界面控件值
2	输入运单号，点击“导入”按钮	运单信息	系统判断是否允许发起运单变更：
1）若允许，则系统搜索运单信息并根据数据元素的对应关系将运单信息带至变更运单界面相应控件；
2）若不允许，则系统弹出提示框给予相应提示。参见业务规则SR1。
3	点击“客户要求”单选按钮		
1.	运单项对应的编辑状态发生变化，参见业务规则SR2；
2.	上传凭证区域显示默认上传的变更凭证名称，参见业务规则SR3。
4	选择变更类型为“转运”		
【转运信息】区域字段变为可编辑状态；
5	用户在“变更原因“输入框内输入客户申请转运的原因	变更原因	
6	用户点击【转运信息】页签，分别录入转运目的站、转运提货网点、
转运运输性质		
1.	转运信息录入操作参见系统用例SUC-496：录入运输信息；
2.	“变更信息”区域显示变更项及其变更前后对应的运单信息，
参见业务规则SR4。
7	点击变更凭证所在行的“上传”按钮  	变更凭证电子件	
弹出【路径选择】模式窗口，参见业务规则SR10
8	选择凭证存放的本地路径，点击“确定”按钮		
凭证上传至变更界面
9	点击“提交”按钮	
	弹出【运单变更信息】对话框，回显转运单变更的信息，参见系统用例SUC-490：显示运单变更明细
10	点击对话框界面的“确定”按钮		
系统弹出对话框提示是否确定提交转运单变更申请。
11	点击“确定”按钮，确定提交运单变更申请		
系统校验是否满足运单变更申请的条件，参见业务规则SR1、SR7
1.	若满足则系统提示运单变更申请成功，同时
1）系统根据凭证存放路径找到凭证文件后保存到系统中；
2）“打印”按钮变为可点击。
2.	若不满足则系统给予提示。

扩展事件

序号	扩展事件	相关数据	备注
2a	运单信息导入起草转运单界面相应控件后，
若再次点击“导入”按钮还原当前运单信息		
4a	若货物已出收货部门库存，
选择“转运”变更类型后，系统提示不能起草转运单		
6a	若转运提货网点为空运或偏线，
还需录入转运配载类型、转运预配航班		
6b	用户可修改其他的运单信息		
“变更信息”区域显示变更项及其变更前后对应的运单信息，
参见业务规则SR4
8a	用户可以点击变更凭证所在行“删除”按钮删除已上传的凭证，
重新选择文件上传	变更凭证电子件	
8b	用户可以点击变更凭证所在行“查看”按钮查看已上传的凭证	
变更凭证电子件	
10a	点击对话框界面的“取消”按钮		
取消运单变更申请，返回运单变更主界面
11a	点击对话框界面的“取消”按钮		
取消运单变更申请，返回运单变更主界面
1.6.2	起草返货单操作步骤

序号	基本步骤	相关数据	补充步骤

1	点击变更运单菜单进入“变更运单”主界面		
系统初始化界面控件值
2	输入运单号，点击“导入”按钮	
运单信息	系统判断是否允许发起运单变更：
1）若允许，则系统搜索运单信息并根据数据元素的对应关系将运单信息带至变更运单界面相应控件；
2）若不允许，则系统弹出提示框给予相应提示。参见业务规则SR1。
3	点击“客户要求”单选按钮		
1.	运单项对应的编辑状态发生变化，参见业务规则SR2；
2.	上传凭证区域显示默认上传的变更凭证名称，参见业务规则SR3。
4	选择变更类型为“返货”		
【返货信息】区域字段变为可编辑状态；
5	用户在“变更原因“输入框内输入客户申请转运的原因	变更原因	
6	用户点击【返货信息】页签，
分别录入转运目的站、转运提货网点、转运运输性质	
	1.	返货信息录入操作参见系统用例SUC-496：录入运输信息；
2.	“变更信息”区域显示变更项及其变更前后对应的运单信息，
参见业务规则SR4。
7	点击变更凭证所在行的“上传”按钮  	
变更凭证电子件	弹出【路径选择】模式窗口
8	选择凭证存放的本地路径，点击“确定”按钮		
凭证上传至变更界面
9	点击“提交”按钮		
弹出【运单变更信息】对话框，回显转运单变更的信息，
参见系统用例SUC-490：显示运单变更明细
10	点击对话框界面的“确定”按钮		
系统弹出对话框提示是否确定提交转运单变更申请。
11	点击“确定”按钮，确定提交运单变更申请		
系统校验是否满足运单变更申请的条件，参见业务规则SR1、SR7
1.	若满足则系统提示运单变更申请成功，同时
1）系统根据凭证存放路径找到凭证文件后保存到系统中；
2）“打印”按钮变为可点击。
2.	若不满足则系统给予提示。

扩展事件

序号	扩展事件	相关数据	备注
2a	运单信息导入起草返货单界面相应控件后，
若再次点击“导入”按钮还原当前运单信息		
4a	若货物已出收货部门库存，
选择“转运”变更类型后，系统提示不能起草转运单		
6a	若返货提货网点为空运或偏线，还需录入转运配载类型、转运预配航班		
6b	用户可修改其他的运单信息		“
变更信息”区域显示变更项及其变更前后对应的运单信息，参见业务规则SR4
8a	用户可以点击变更凭证所在行“删除”按钮删除已上传的凭证，
重新选择文件上传	变更凭证电子件	
8b	用户可以点击变更凭证所在行“查看”按钮查看已上传的凭证	变更凭证电子件	
10a	点击对话框界面的“取消”按钮		
取消运单变更申请，返回运单变更主界面
11a	点击对话框界面的“取消”按钮		
取消运单变更申请，返回运单变更主界面

1.7	业务规则
序号	描述
SR1	
下表为不能起草运单变更的类型及不能起草时系统提示内容

序号	不能起草运单变更的类型	提示内容

	运单状态为“已保存待补录”的运单	
	运单未补录，不能起草运单变更！
2	运单状态为“作废”、“中止”的运单	
运单已作废，不能起草运单变更！
运单已中止，不能起草运单变更！
3	运单对应的收货部门与系统当前组织不一致	该单的收货部门不是您部门，不能起草运单变更！
4	运单状态为“已签收”的运单	货物已签收，
不能起草运单变更！
5	变更单状态为“待审核”或“待受理”的运单	
该运单有运单变更单还未被审核，不能起草变更运单！
该运单有运单变更单还未被受理，不能起草变更运单！
6	运单已进行结清货款操作	
该运单已进行结清货款操作，如需更改请联系到达部门进行反结清货款操作！
7	财务锁定的运单（财务将不允许发起变更的运单进行锁定）不能发起运单变更 
该运单已被财务锁定，不能起草变更运单！
8	偏线运单以外发	偏线运单已中转外发，不能起草运单变更！


SR2	1．	运单无出库记录，不允许起草转运单、返货单；
a.	客户来源可以选择更改、作废；
b.	内部来源可以选择更改、中止
2．	运单出库记录，不允许起草作废单，涉及到目的站、
提货网点的修改必须到转运信息、返货信息面板修改；如果变更提货方式，
由“派送”该为“自提”，原始目的站不支持“自提”，提示“原始目的站不支持自提，
请选择转运或返货类型”
a.	客户来源可以选择更改、转运、返货；
c.	内部来源可以选择更改、中止
3．	若未选择变更要求（客户要求/内部要求），
运单信息显示区域的控件为不可编辑状态；若选择了变更要求，
则不可变更的运单项对应的控件为不可编辑状态，可以变更的运单项对应的控件为可编辑状态
。运单项能否进行变更主要受变更要求、
运输类型、货物当前库存部门三个维度的影响。
其中客户要求发起的转运或返货变更，
可变更及不可变更的运单项请详见下表：
     

SR3	1.	选择客户要求变更时，上传凭证名称默认显示为“身份证复印件”及“运单客户联”，
可另新增变更凭证；选择内部要求变更时，上传凭证名称默认显示为“运单原件”，可另新增变更凭证；
2.	默认显示的变更凭证所在行不可删除，
新增的变更凭证所在行可删除；
3.	已选择上传的变更凭证可点击查看，也可点击删除。
SR4	1.	“变更项”列显示为变更的运单项名称，
“变更前信息”列显示变更项在变更前对应的运单信息，
“变更后信息”列显示变更项在变更后对应的运单信息。如是转运或返货变更：
“目的站”变更项对应的变更前信息为原目的站，变更后信息为转运/返货目的站；
“提货网点”变更项对应的变更前信息为原提货网点，变更后信息为转运/返货提货网点。
2.	对于“上门接货”、“预付费保密”、“大车直送”、
“贵重物品”、“特殊物品”为复选框的变更项，变更前后对应的信息根据复选框勾选与否显示为是或否；
3.	若变更项变更前信息或变更后信息为空，
则“变更前信息”或“变更后信息”列显示为:—；
4.	以下运单项不列入变更项：计费类型、计费重量、费率、
保价费率、代收费率、装卸费、其他费用（总金额）、转运运输性质、
转运配载类型、转运预配航班、转运计费类型、转运费率、返货运输性质、返货计费类型；
5.	变更项行显示顺序为：
运单基础信息变更项→发货客户信息变更项→收货客户信息变更项→运输信息变更项→货物信息变更项→增值业务信息变更项→详细计价信息变更项→计费付款信息变更项；
6.	“变更前信息”与“变更后信息”列显示内容不能相同。
SR5	转运信息对应的相关业务规则：
1.	转运目的站：转运提货网点对应的目的站，与收货人地址、提货方式进行关联。
2.	转运提货网点：转运后的提货网点，与收货人地址、提货方式进行关联。
3.	转运运输性质：
1）	原运输类型为汽运：以原目的站作为转运始发站，
与转运目的站匹配运输性质；
2）	原运输类型为偏线或空运：
ⅰ 若货物未出原最终配载部门库存，以原最终配载部门所在城市作为转运始发站，
与转运目的站匹配运输性质；
ⅱ 若货物已出原最终配载部门库存，转运运输性质只能为偏线或空运。
4.	提货方式：起草转运单时，提货方式与原运输信息取消关联，
与转运提货网点进行关联。
5.	转运配载类型：转运运输性质为空运时，包含合大票、单独开单；
其他转运运输性质时，只含有汽运。
6.	转运预配航班：转运运输性质为空运时为可选状态，
包含早班、中班、晚班。
7.	转运计费类型：分为重量计费、体积计费，
系统根据货物重量、体积、转运费率确定转运计费类型。
8.	转运费率：
1)	原运输类型为汽运：原目的站作为转运始发站，
系统根据转运始发站、转运目的站、转运运输性质读取公布价基础资料
（上门发货公布价）来确定转运费率，若未读取到公布价，则人工录入转运费率。
2)	原运输类型为偏线或空运：
ⅰ 若货物未出原最终配载部门库存，
系统根据原最终配载部门所在城市、转运目的站、转运运输性质读取公布价基础资料（
上门发货公布价）来确定转运费率，若未读取到公布价，则人工录入转运费率；
ⅱ 若货物已出原最终配载部门库存，则人工录入转运费率。
    注：转运费率读取的公布价为运单开单时对应的产品价格版本
9.	转运费：
1）计费类型为“重量计费”时，转运费=转运费率*重量；
2）计费类型为“体积计费”时，转运费=转运费率*体积。
注：转运费无最低一票。
返货信息对应的相关业务规则：
1.	返货目的站：返货提货网点对应的目的站，与收货人地址进行关联。。
2.	返货提货网点：货物返回的提货网点，与收货人地址进行关联，
只能选择公司自有营业网点。
3.	返货运输性质：
1）	原运输类型为汽运：
ⅰ 货物未出第一中转外场库存：第一中转外场所在城市作为返货始发站，
与返货目的站匹配返货运输性质；
ⅱ 货物已出第一中转外场库存：以原目的站作为返货始发站，
与返货目的站匹配运输性质；
2）	原运输类型为偏线或空运：
ⅰ 货物未出第一中转外场库存：第一中转外场所在城市作为返货始发站，
与返货目的站匹配返货运输性质；
ⅱ 货物已出第一中转外场库存，未出原最终配载部门库存：
以原最终配载部门所在城市作为返货始发站，与返货目的站匹配运输性质。
ⅲ 货物已出原最终配载部门库存：返货运输性质只能为偏线或空运。
4.	返货计费类型：分为重量计费、体积计费，系统根据货物重量、
体积、返货费率确定返货计费类型。
5.	返货费率：
1）	原运输类型为汽运：
ⅰ 货物未出第一中转外场库存：第一中转外场所在城市作为返货始发站，
系统根据返货始发站、返货目的站、返货运输性质读取公布价基础资料（上门发货公布价）来确定返货费率，原费率变为原运输性质下的收货部门至返货始发站的费率；
ⅱ 货物已出第一中转外场库存：原目的站作为返货始发站，
系统根据返货始发站、返货目的站、返货运输性质读取公布价基础资料（上门发货公布价）来确定返货费率，原费率不变。
2）	原运输类型为偏线或空运：
ⅰ 货物未出第一中转外场库存：第一中转外场所在城市作为返货始发站，
系统根据返货始发站、返货目的站、返货运输性质读取公布价基础资料（上门发货公布价）
来确定返货费率，原费率变为原运输性质下的收货部门至返货始发站的费率；
ⅱ 货物已出第一中转外场库存，未出原最终配载部门库存：
原最终配载部门所在城市作为返货始发站，系统根据返货始发站、返货目的站、
返货运输性质读取公布价基础资料（上门发货公布价）来确定返货费率，
原费率变为原运输性质下的收货部门至返货始发站的费率；
ⅲ 货物已出原最终配载部门库存：人工录入返货费率，原费率不变。
注：返货费率读取的公布价为运单开单时对应的产品价格版本。
6.	返货费：
1）	计费类型为“重量计费”时，返货费=返货费率*重量；
2）	计费类型为“体积计费”时，返货费=返货费率*体积。
注：返货费无最低一票。
SR6	1.	运单信息的修改录入操作参照运单生成相关系统用例的操作；
2.	修改运单信息时，系统校验的业务规则参照运单生成相关系统用例的业务规则。
SR7	1.	起草转运单时，关键增值服务信息的变更规则：

运单项	起草运单变更时对应的版本
费率	产品在运单信息生成时对应的公布价版本
保价费率	运单信息生成时的保价费率版本
代收费率	运单信息生成时的代收费率版本
公布价运费	运单信息生成时的公布价运费版本
保价费	运单信息生成时对应的收费标准
代收手续费	运单信息生成时对应的收费标准
送货费	运单信息生成时对应的收费标准
装卸费	运单信息生成时对应的收费标准
其他费用项	运单信息生成时的收费标准
优惠费用	运单开单信息生成时对应的优惠标准

2.	起草返货单时，关键增值服务信息的变更规则：
   
运单项	起草运单变更时对应的版本
费率	若货物未出第一中转库存：原运输性质下的收货部门至返货始发站的费率
（返货始发站为第一中转外场对应的城市），费率为运单开单时对应的版本
	若货物已出第一中转库存：产品在运单信息生成时对应的公布价版本
保价费率	运单信息生成时的保价费率版本
代收费率	运单信息生成时的代收费率版本
公布价运费	运单信息生成时的公布价运费版本
保价费	运单信息生成时对应的收费标准
代收手续费	运单信息生成时对应的收费标准
送货费	运单信息生成时对应的收费标准
装卸费	运单信息生成时对应的收费标准
其他费用项	运单信息生成时的收费标准
优惠费用	运单开单信息生成时对应的优惠标准

综上：起草转运单或返货单时，产品及价格优惠版本统一执行运单开单时对应的版本。
3.	含有代收货款的运单，如取消代收货款（代收货款金额更改为0）：
若货物未出收部门库存，代收手续费变为0；若货物已出收货部门库存，代收手续费不变。
SR8	提交转运单或返货单时必须已上传变更凭证，否则不能提交申请
SR89	成功提交转运单或返货单申请后，方可打印变更单
SR109	1.	弹出路径选择框，默认指定路径在桌面，可选择保存路径；
2.	可上传的凭证扫描件，应该为图片，格式允许选择常见的JPG,GIF,PNG,BPM；
上传图片大小有所限制（默认250K，允许系统后台配置），如果超出所设范围，
系统给出提示“您上传的文件已超过最大允许大小250K，请调整后重新上传。”。
SR1011	对于发货客户的变更：
1.	同一发货客户，若客户资质发生变化；
a)	开单时为合同客户，开单后（起草更改单之前）客户属性变为非合同客户： 
FOSS在开单时记录客户资质，起草更改单时仍可选择免费送货；
b)	开单时为非合同客户，开单后（起草更改单之前）客户属性升级为合同客户：
起草更改单时仍可选择免费送货；
2.	由某一发货客户更改为另一发货客户
a)	合同客户更改为非合同客户：原开单提货方式为免费送货，与开单时保持一致，
即直接清空提货方式，重新选择提货方式;
3.	非合同客户更改为合同客户：提货方式中增加"免费送货"选项。
SR1112	1.	货物未到达第一打木架外场（开单录入代打木架信息时系统自动生成的代打木架信息），允许修改代打包装信息
2.	货物已到达第一打木架外场，则不可发起代打包装信息更改
3.	若有代打包装，则在录入代打包装信息后，系统自动计划出代打包装费用，显示至包装费中，营业员或开单员可以任意修改包装费。
4.	在更改单界面中，加入代打包装货物件数的选择，即流水号选择。在发起代打包装更改单时，打开的代打包装信息中默认勾选开单录入的代装包装总件数的流水号，即：开单录入代打木架4件，代打木箱3件，则在更改单代打包装信息中，自勾选流水号1-7；
允许点击“代打木架”按钮直接修改打包装信息
SR12	1、货物离开出发部门库存后，客户要求将目的站更改为异地目的站，须收取中转费。例如，客户要求将原发往重庆北碚区营业部的货物更改至四川泸州蓝田营业部，虽然是同一外场配载，但分属不同地级市，须收取中转费。 
2、货物离开出发部门库存后，客户要求将目的站更改为同城目的站： 
 2.1、货物离开出发部门库存后至到达部门上一级外场交接出库前，不收取中转费。例如客户要求将原发往上海浦东上南路营业部的货物更改至上海派送部，虽然是不同外场配载，但分属同意地级市，不收取中转费 
 2.2、货物在到达部门（驻地派送部为到达部门）库存中，更改为同城部门，须收取中转费 
 2.3、货物离开到达部门上一级外场库存或有交接记录且交接目的站为原到达部门，须收取中转费 

注：同城定义：以原到达部门所在地级市为判断依据。更改前后部门在同一地级市行政区域范围内为同城，更改前后部门不在同一地级市行政区域范围内为异地。 
SR13	更改单界面添加查询网点、公布价、查询客户、打印标签功能按钮，可参考开单界面
SR14	香港开点业务：
1. 运单新增、运单查询中，收/发货人手机只能填写8位或11位数字，11位数字必须以1开头
2. 收货部门的省市为香港时，燃油附加费可修改
1.8	数据元素
1.8.1	变更基本录入信息
字段名称 	说明 	输入限制	输入项提示文本	长度	是否必填	备注
客户要求	客户提出的运单变更申请	单选框		10	是	默认为空
内部要求	由于内部开单失误而提出的运单变更申请	单选框		10	是	默认为空
变更类型	变更运单的类型，客户要求下包含：转运、返货、作废、更改，内部要求下包含更改、中止。	下拉框		10	是	默认为空“更改”
变更原因	变更运单的原因	文本		80	是	默认为空
1.8.2	运单基础信息
字段名称 	说明 	输入限制	输入项提示文本	长度	是否必填	备注
收货部门	收取货物的部门				是	
变更单号	点击可变更运单单号	复选框			否	可勾选时，则勾选后显示变更单号文本框（可编辑）
上门接货	前往客户处接收货物	复选框			否	
1.8.3	发货客户信息
字段名称 	说明 	输入限制	输入项提示文本	长度	是否必填	备注
手机	发货联系人的手机号码	文本			否	导入运单信息
电话	发货联系人的电话号码	文本			否	导入运单信息
客户名称	发货企业客户的公司名，个人客户的姓名	公共选择框			是	导入运单信息
联系人	发货客户的个人代表	文本			是	导入运单信息
地址	发货客户的联系地址	文本			否	导入运单信息
1.8.4	收货客户信息
字段名称 	说明 	输入限制	输入项提示文本	长度	是否必填	备注
手机	收货联系人的手机号码	文本			否	
电话	收货联系人的电话号码	文本			否	
联系人	收货客户的个人代表	文本			是	
地址	收货客户的联系地址	文本			否	提货方式为送货时必填
1.8.5	运输信息
字段名称 	说明 	输入限制	输入项提示文本	长度	是否必填	备注
货物状态	货物当前状态，包含：收货部门库存中、收货部门已出库（已出收货部门库存，中转部门未入库）、中转部门库存中、中转部门已出库（已出中转部门库存，即货物在途运输）、到达部门库存中、到达部门送货中。	文本			是	系统自动带出数据
注：分批配载的货物，以距离最终配载部门最近的部门作为参照。
提货方式	货物提取方式	下拉框			是	
目的站	货物的目的站	文本			是	显示更改前的目的站
提货网点	货物的提货网点	文本			是	显示更改前的提货网点
运输性质	货物的运输性质	文本			是	
配载类型	货物的配载类型	文本			否	由运输性质决定
预配航班	空运班次，含早班、中班、晚班	文本			否	
返单类别	签收单返回类型，含签收单原件返回、传真返回、扫描上传、无需返回	下拉框			是	
对外备注	传达给客户的备注信息	下拉框				可选择多项
对内备注	公司内部备注信息	文本			是	
1.8.6	转运信息
字段名称 	说明 	输入限制	输入项提示文本	长度	是否必填	备注
转运目的站	转运提货网点对应的目的站	文本			是	
转运提货网点	转运的提货网点	公共选择框			是	
转运运输性质	转运运输性质	下拉框			是	
转运配载类型	转运的配载类型	下拉框			否	
转运预配航班	转运为空运的预配航班	下拉框			否	
转运计费类型	转运货物的计费类型	文本			是	
转运费率	转运货物计费费率	文本			是	
转运费	转运货物费用	文本			是	
1.8.7	转运记录
字段名称 	说明 	输入限制	输入项提示文本	长度	是否必填	备注
转运目的站	转运提货网点对应的目的站					
转运提货网点	转运的提货网点					
转运运输性质	转运运输性质					
转运配载类型	转运的配载类型					若无则显示为空
转运预配航班	转运为空运的预配航班					若无则显示为空
转运计费类型	转运货物的计费类型					
转运费率	转运货物计费费率					
转运费	转运货物费用					

1.8.8	返货信息
字段名称 	说明 	输入限制	输入项提示文本	长度	是否必填	备注
返货目的站	返货提货网点对应的目的站	文本			是	
返货提货网点	货物返回的提货网点	公共选择框			是	
返货运输性质	货物返回运输性质 	下拉框			是	
返货计费类型	货物返回的计费类型	文本			是	
返货费率	货物返回的计费费率	文本			是	
返货费	返货费用	文本			是	
1.8.9	货物信息
字段名称 	说明 	输入限制	输入项提示文本	长度	是否必填	备注
名称	货物的名称	文本			是	
包装	货物的外包装	文本			是	
件数	货物的件数	文本			是	
重量	货物的重量	文本			是	
尺寸	货物的尺寸	文本			否	
体积	货物的体积	文本			是	
货物类型	货物的A/B类型，区分大小货	单选按钮			否	
大车直送		复选框			否	
贵重物品		复选框			否	
特殊物品		复选框			否	
1.8.10	增值业务信息
字段名称 	说明 	输入限制	输入项提示文本	长度	是否必填	备注
保价声明价值	货物保价金额	文本		8	是	
代收货款	代收货款金额	文本		8	是	
退款类型	代收货款退款方式	下拉框			否	
收款人	代收货款收款人	文本			否	
收款账号	收款人银行账号	文本			否	
包装费	货物包装费用	文本			是	若无则输入0
送货费	货物送货费用	文本			是	若无则输入0
装卸费	装卸费用	文本			是	若无则输入0
1.8.11	计费付款信息
字段名称 	说明 	输入限制	输入项提示文本	长度	是否必填	备注
公布价运费	根据公布价计算的运费				是	公布价运费=运费+转运费或返货费
增值服务费	增值服务费用总计				是	增值服务费=运单增值服务费+转运费或返货费
优惠费用	优惠打折的总费用				是	
费用合计	向客户收取的费用总计				是	
付款方式	承运费用付款的方式	下拉框			是	
到付金额	收货客户需要支付的费用	文本			是	若无则输入0
现付金额	发货客户需要支付的费用	文本			是	若无则输入0
预付费保密	对预付费用进行保密	复选框			否	
1.8.12	变更信息
字段名称 	说明 	输入限制	输入项提示文本	长度	是否必填	备注
变更项	运单信息发生变更的项目				是	系统根据更改项自动生成显示
变更前信息	变更项变更前对应的运单信息				是	系统自动生成
变更后信息	变更项变更后对应的运单信息				是	系统自动生成
1.8.13	详细计价信息（转运）
字段名称 	说明 	输入限制	输入项提示文本	长度	是否必填	备注
计费类型	变更前运费与转运费进行累加后对应的计费类型				是	
计费重量	变更前运费与转运费进行累加后对应计费重量				是	
费率	变更前运费与转运费进行累加后对应的费率				是	
保价费率					是	
代收费率					是	
运费	变更前运费+转运费				是	
保价费					是	
代收手续费					是	
包装费					是	
送货费					是	
其他费用					是	
优惠费用					是	
费用合计						
1.8.14	详细计价信息（返货）
字段名称 	说明 	输入限制	输入项提示文本	长度	是否必填	备注
计费类型	变更前运费与返货费进行累加后对应的计费类型				是	
计费重量	变更前运费与返货费进行累加后对应计费重量				是	
费率	变更前运费与返货费进行累加后对应的费率				是	
保价费率					是	
代收费率					是	
运费	变更前运费+返货费				是	
保价费					是	
代收手续费					是	
包装费					是	
送货费					是	
其他费用					是	
优惠费用					是	
费用合计						
1.9	非功能性需求
使用量	每天处理的运单约为1000000单，变更运单的数量占比约为20% 
2012年全网估计用户数	营业员数量约10000名
响应要求（如果与全系统要求 不一致的话）	系统一般需求
使用时间段	营业部上班时间
高峰使用时间段	9:00-16:00
1.10	接口描述：
接口名称 	对方系统（外部系统或内部其他模块）	接口描述
客户信息接口	CRM系统	FOSS调用CRM客户信息接口，
查询录入客户信息
电子地图接口	GIS系统	FOSS调用电子地图接口查询录入目的站、提货网点信息
库存接口	中转子系统	FOSS调用中转库存接口判断货物是否已签收出库
财务类变更接口	结算系统	FOSS调用该接口判断是否可发起财务类变更


 */
/**
 * 1.5.3	界面描述
主界面标题：变更运单。
“变更运单”主界面包含变更基本条件录入区域、
运单信息显示及编辑区域、功能按钮区域。
起草变更单（内部）操作：用户进入“变更运单”主界面后
（见起草变更单（内部）界面-1），
导入运单信息至操作界面，
选择运单变更为“内部要求”，
录入变更原因并修改运单信息，
最终上传变更凭证提交运单变更申请。
1.变更基本条件录入区域：
1）单号：起草运单变更对应的运单号。
2）客户要求：
由于客户原因发起的运单变更需求；
3）内部要求：
由于内部操作失误发起的运单变更需求；
4）变更类型：
客户要求的运单变更包含转运、返货、更改、作废，
内部要求的变更包含更改、中止。
5）变更原因：
起草变更运单的原因。
2.运单信息显示及编辑区域：
1）运单基础信息：
包含收货部门、变更单号、上门接货。
2）发货客户信息：
包含发货人手机、电话、客户名称、联系人、地址。
3）收货客户信息：
包含收货人手机、电话、联系人、地址。
4）运输信息：
包含货物状态、提货方式、目的站、提货网点、
运输性质、配载类型、预配航班、
返单类别、对外备注、对内备注。
5）货物信息：货物的基本信息，
包含货物名称、包装、件数、重量、尺寸、
体积、货物类型、大车直送、
贵重物品、特殊物品。
5）增值业务信息：包含保价声明价值、代收货款、
退款类型、收款人、收款账号、包装费、
送货费、装卸费、其他费用项。
6）计费付款信息：包含公布价运费、
增值服务费、优惠费用、费用合计、
付款方式、到付金额、现付金额、
预付费保密。
7）详细计价信息：默认隐藏不显示，
点击向左伸展按钮后伸展显示（见起草变更单
（内部）界面-2）。包含计费类型、计费重量、
费率、运费、保价声明价值、保价费率、保价费、
代收货款、代收费率、代收手续费、包装费、
送货费、其他费用、优惠费用、费用合计。
8）变更信息：变更运单条目明细显示。
该区域主要显示变更的项目及变更前后对应的运单信息。
9）上传凭证区域：
上传变更凭证电子件。
3.功能按钮：
导入：点击导入按钮将运单号对应的运单信息展现在变更运单界面。
提交：点击提交变更运单申请。
打印：提交运单变更后，可点击打印变更单。
1.6	操作步骤
序号	基本步骤	相关数据	补充步骤
1	点击变更运单菜单进入“变更运单”主界面		系统初始化界面控件值
2	输入运单号，点击“导入”按钮	运单信息	系统判断是否允许发起运单变更：
1）若允许，则系统搜索运单信息并根据数据元素的对应关系将运单信息带至变更运单界面相应控件，
参见业务规则SR1；
2）若不允许，则系统弹出提示框给予相应提示。
参见业务规则SR2
3	点击“内部要求”单选按钮 		
1.	运单项对应的编辑状态发生变化，
参见业务规则SR3；
2.	上传凭证区域显示默认上传的变更凭证名称，
参见业务规则SR4。
4	用户在“变更原因“输入框内输入内部申请变更运单的原因	变更运单原因	
5	用户在运单信息显示区域修改相应的运单信息		
“变更信息”区域显示变更项及其变更前后对应的运单信息，参见业务规则SR5
6	点击变更凭证所在行的“上传”按钮 	变更凭证电子件	
弹出【路径选择】模式窗口，参见业务规则SR10
7	选择凭证存放的本地路径，点击“确定”按钮		
凭证上传至变更界面
8	点击“提交”按钮		弹出【运单变更信息】对话框，
回显运单变更的信息，参见系统用例SUC-490：显示运单变更明细
9	点击对话框界面的“确定”按钮		
系统弹出对话框提示是否确定提交运单变更申请。
10	点击“确定”按钮，确定提交运单变更申请		
系统校验是否满足运单变更申请的条件，参见业务规则SR2、SR8
1.	若满足则系统提示运单变更申请成功，同时
1）系统根据凭证存放路径找到凭证文件后保存到系统中；
2）“打印”按钮变为可点击。
2.	若不满足则系统给予提示。

扩展事件

序号	扩展事件	相关数据	备注
2a	输入运单号，点击“导入”按钮后，
若未找到对应的运单信息，系统给以提示		
2b	运单信息导入变更运单界面相应控件后，
若再次点击“导入”按钮还原当前运单信息		
7a	用户可以点击变更凭证所在行“删除”按钮删除已上传的凭证，
重新选择文件上传	变更凭证电子件	
7b	用户可以点击变更凭证所在行“查看”按钮查看已上传的凭证	
变更凭证电子件	
8a	若未对运单信息做任何修改，
提交时系统给予提示不能提交		
9a	点击对话框界面的“取消”按钮		
取消运单变更申请，返回运单变更主界面
10a	点击对话框界面的“取消”按钮		
取消运单变更申请，返回运单变更主界面
1.7	业务规则
序号	描述
SR1	1.  由于整车运单信息与非整车运单信息不同，
导入整车运单至变更运单界面后，
整车运单信息中不存在的字段控件值为空，不可编辑。
2.  如导入的运单为整车运单，
则运输性质控件显示为“整车”。
SR2	
下表为不能起草运单变更的类型及不能起草时系统提示内容

序号	不能起草运单变更的类型	提示内容
1	运单状态为“已保存待补录”的运单	
运单未补录，不能起草运单变更！
2	运单状态为“作废”、“中止”的运单	
运单已作废，不能起草运单变更！
运单已中止，不能起草运单变更！
3	运单对应的收货部门与系统当前组织不一致	该单的收货部门不是您部门，
不能起草运单变更！
4	运单状态为“已签收”的运单	货物已签收，
不能起草运单变更！
5	变更单状态为“待审核”或“待受理”的运单	
该运单有运单变更单还未被审核，不能起草变更运单！
该运单有运单变更单还未被受理，不能起草变更运单！
6	运单已进行结清货款操作	该运单已进行结清货款操作，
如需更改请联系到达部门进行反结清货款操作！
7	财务锁定的运单（财务将不允许发起变更的运单进行锁定）
不能发起运单变更 
该运单已被财务锁定，
不能起草变更运单！


SR3	1．	运单无出库记录，
不允许起草转运单、返货单；
a.	客户来源可以选择更改、作废；
b.	内部来源可以选择更改、中止
2．	运单出库记录，不允许起草作废单，
涉及到目的站、提货网点的修改必须到转运信息、
返货信息面板修改；如果变更提货方式，
由“派送”该为“自提”，原始目的站不支持“自提”，
提示“原始目的站不支持自提，请选择转运或返货类型”
a.	客户来源可以选择更改、转运、返货；
c.	内部来源可以选择更改、中止
3．	若未选择变更要求（客户要求/内部要求），
运单信息显示区域的控件为不可编辑状态；
若选择了变更要求，
则不可变更的运单项对应的控件为不可编辑状态，
可以变更的运单项对应的控件为可编辑状态。
运单项能否进行变更主要受变更要求、
运输类型、货物当前库存部门三个维度的影响。
其中内部要求发起的运单变更，
可变更及不可变更的运单项请详见下表：
     

SR4	1.	选择客户要求变更时，
上传凭证名称默认显示为“身份证复印件”及“运单客户联”，
可另新增变更凭证；选择内部要求变更时，
上传凭证名称默认显示为“运单原件”，
可另新增变更凭证；
2.	默认显示的变更凭证所在行不可删除，
新增的变更凭证所在行可删除；
3.	已选择上传的变更凭证可点击查看，
也可点击删除。
SR5	1.	 “变更项”列显示为变更的运单项名称，
“变更前信息”列显示变更项在变更前对应的运单信息，
“变更后信息”列显示变更项在变更后对应的运单信息。
如是转运或返货变更：“目的站”变更项对应的变更前信息为原目的站，
变更后信息为转运/返货目的站；
“提货网点”变更项对应的变更前信息为原提货网点，
变更后信息为转运/返货提货网点。
2.	对于“上门接货”、“预付费保密”、“大车直送”、
“贵重物品”、“特殊物品”为复选框的变更项，
变更前后对应的信息根据复选框勾选与否显示为是或否；
3.	若变更项变更前信息或变更后信息为空，
则“变更前信息”或“变更后信息”列显示为:—；
4.	以下运单项不列入变更项：计费类型、
计费重量、费率、保价费率、代收费率、装卸费、
其他费用（总金额）、转运运输性质、转运配载类型、
转运预配航班、转运计费类型、转运费率、
返货运输性质、返货计费类型；
5.	变更项行显示顺序为：运单基础信息变更项→
发货客户信息变更项→收货客户信息变更项→运输信息变更项→
货物信息变更项→增值业务信息变更项→详细计价信息变更项→计费付款信息变更项；
6.	“变更前信息”与“变更后信息”列显示内容不能相同。
SR6	1.	运单信息的修改录入操作参照运单生成相关系统用例的操作；
2.	修改运单信息时，
系统校验的业务规则参照运单生成相关系统用例的业务规则。
SR7	1.	关键增值服务信息的变更规则：

运单项	起草运单变更时对应的版本
费率	产品在运单信息生成时对应的公布价版本
保价费率	运单信息生成时的保价费率版本
代收费率	运单信息生成时的代收费率版本
公布价运费	运单信息生成时的公布价运费版本
保价费	运单信息生成时对应的收费标准
代收手续费	运单信息生成时对应的收费标准
送货费	运单信息生成时对应的收费标准
装卸费	运单信息生成时对应的收费标准
其他费用项	运单信息生成时的收费标准
优惠费用	运单开单信息生成时对应的优惠标准

综上：起草变更单（内部）时，产品及价格优惠版本统一执行运单开单时对应的版本。
举例：
公布价运费：运单开单时精准卡航对应的公布价（上门发货）运费最低一票为40元，在开单后系统维护调整为50元最低一票。则在起草变更单时，最低一票仍执行运单开单时的标准，即为40元一票。
2.	含有代收货款的运单，如取消代收货款（代收货款金额更改为0），代收手续费变为0。
SR8	提交变更运单时必须已上传变更凭证，否则不能提交
SR9	成功提交运单变更后，方可打印变更单
SR10	1.	弹出路径选择框，
默认指定路径在桌面，可选择保存路径；
2.	可上传的凭证扫描件，应该为图片，格式允许选择常见的JPG,GIF,PNG,BPM；
3.	上传图片大小有所限制（默认250K，允许系统后台配置），
如果超出所设范围，系统给出提示“您上传的文件已超过最大允许大小250K，请调整后重新上传。”。
SR11	对于发货客户的变更：
1.	同一发货客户，若客户资质发生变化；
a)	开单时为合同客户，开单后（起草更改单之前）
客户属性变为非合同客户： FOSS在开单时记录客户资质，起草更改单时仍可选择免费送货；
b)	开单时为非合同客户，开单后（起草更改单之前）
客户属性升级为合同客户：起草更改单时仍可选择免费送货；
2.	由某一发货客户更改为另一发货客户
a)	合同客户更改为非合同客户：原开单提货方式为免费送货，
与开单时保持一致，即直接清空提货方式，重新选择提货方式;
b)	非合同客户更改为合同客户：提货方式中增加"免费送货"选项。
SR12	1.	货物未到达第一打木架外场（开单录入代打木架信息时系统自动生成的代打木架信息），
允许修改代打包装信息
2.	货物已到达第一打木架外场，则不可发起代打包装信息更改
3.	若有代打包装，则在录入代打包装信息后，
系统自动计划出代打包装费用，显示至包装费中，
营业员或开单员可以任意修改包装费。
4.	在更改单界面中，加入代打包装货物件数的选择，
即流水号选择。在发起代打包装更改单时，
打开的代打包装信息中默认勾选开单录入的代装包装总件数的流水号，
即：开单录入代打木架4件，代打木箱3件，
则在更改单代打包装信息中，自勾选流水号1-7；
5.	允许点击“代打木架”按钮直接修改打包装信息
1.8	数据元素
1.8.1	变更基本录入信息
字段名称 	说明 	输入限制	输入项提示文本	长度	是否必填	备注
客户要求	客户提出的运单变更申请	单选框		10	是	默认为空
内部要求	由于内部开单失误而提出的运单变更申请	单选框		10	是	默认为空
变更类型	变更运单的类型，客户要求下包含：转运、返货、作废、更改，内部要求下包含更改、中止。	下拉框		10	是	默认为“更改”
变更原因	变更运单的原因	文本		80	是	默认为空
1.8.2	运单基础信息
字段名称 	说明 	输入限制	输入项提示文本	长度	是否必填	备注
收货部门	收取货物的部门				是	
变更单号	点击可变更运单单号	复选框			否	
可勾选时，则勾选后显示变更单号文本框（可编辑）
上门接货	前往客户处接收货物	复选框			否	

1.8.3	发货客户信息
字段名称 	说明 	输入限制	输入项提示文本	长度	是否必填	备注
手机	发货联系人的手机号码	文本			否	导入运单信息
电话	发货联系人的电话号码	文本			否	导入运单信息
客户名称	发货企业客户的公司名，个人客户的姓名	公共选择框			是	导入运单信息
联系人	发货客户的个人代表	文本			是	导入运单信息
地址	发货客户的联系地址	文本			否	导入运单信息
1.8.4	收货客户信息
字段名称 	说明 	输入限制	输入项提示文本	长度	是否必填	备注
手机	收货联系人的手机号码	文本			否	
电话	收货联系人的电话号码	文本			否	
联系人	收货客户的个人代表	文本			是	
地址	收货客户的联系地址	文本			否	提货方式为送货时必填
1.8.5	运输信息
字段名称 	说明 	输入限制	输入项提示文本	长度	是否必填	备注
货物状态	货物当前状态，包含：收货部门库存中、
收货部门已出库（已出收货部门库存，中转部门未入库）、
中转部门库存中、中转部门已出库（已出中转部门库存，即货物在途运输）、
到达部门库存中、到达部门送货中。	文本			是	系统自动带出数据
注：分批配载的货物，以距离最终配载部门最近的部门作为参照。
提货方式	货物提取方式	下拉框			是	
目的站	货物的目的站	文本			是	
提货网点	货物的提货网点	公共选择框			是	
运输性质	货物的运输性质	下拉框			是	
配载类型	货物的配载类型	下拉框			是	由运输性质决定
预配航班	空运班次，含早班、中班、晚班	下拉框			是	
返单类别	签收单返回类型，含签收单原件返回、传真返回、扫描上传、无需返回	下拉框			是	
对外备注	传达给客户的备注信息	下拉框				可选择多项
对内备注	公司内部备注信息	文本			是	
1.8.6	货物信息
字段名称 	说明 	输入限制	输入项提示文本	长度	是否必填	备注
名称	货物的名称	文本			是	
包装	货物的外包装	文本			是	
件数	货物的件数	文本			是	
重量	货物的重量	文本			是	
尺寸	货物的尺寸	文本			否	
体积	货物的体积	文本			是	
货物类型	货物的A/B类型，区分大小货	单选按钮			否	
大车直送		复选框			否	
贵重物品		复选框			否	
特殊物品		复选框			否	
1.8.7	增值业务信息
字段名称 	说明 	输入限制	输入项提示文本	长度	是否必填	备注
保价声明价值	货物保价金额	文本		8	是	
代收货款	代收货款金额	文本		8	是	
退款类型	代收货款退款方式	下拉框			否	
收款人	代收货款收款人	文本			否	
收款账号	收款人银行账号	文本			否	
包装费	货物包装费用	文本			是	若无则输入0
送货费	货物送货费用	文本			是	若无则输入0
装卸费	装卸费用	文本			是	若无则输入0
1.8.8	计费付款信息
字段名称 	说明 	输入限制	输入项提示文本	长度	是否必填	备注
公布价运费	根据公布价计算的运费				是	公布价运费=运费+转运费或返货费
增值服务费	增值服务费用总计				是	
优惠费用	优惠打折的总费用				是	
费用合计	向客户收取的费用总计				是	
付款方式	承运费用付款的方式	下拉框			是	
到付金额	收货客户需要支付的费用	文本			是	若无则输入0
现付金额	发货客户需要支付的费用	文本			是	若无则输入0
预付费保密	对预付费用进行保密	复选框			否	
1.8.9	变更信息
字段名称 	说明 	输入限制	输入项提示文本	长度	是否必填	备注
变更项	运单信息发生变更的项目				是	系统根据更改项自动生成显示
变更前信息	变更项变更前对应的运单信息				是	系统自动生成
变更后信息	变更项变更后对应的运单信息				是	系统自动生成
1.8.10	详细计价信息
字段名称 	说明 	输入限制	输入项提示文本	长度	是否必填	备注
计费类型	分为重量计费、体积计费两种				是	系统自动生成
计费重量	空运时为必填项，汽运时不可编辑				否	系统自动计算生成
费率					是	
保价费率					是	
代收费率					是	
运费					是	
保价费					是	
代收手续费					是	
包装费					是	
送货费					是	
其他费用					是	
优惠费用					是	
费用合计					是	
1.9	非功能性需求
使用量	每天处理的运单约为1000000单，变更运单的数量占比约为20%
2012年全网估计用户数	营业员数量约10000名
响应要求（如果与全系统要求 不一致的话）	系统一般需求
使用时间段	营业部上班时间
高峰使用时间段	9:00-16:00，19:00-21:00
1.10	接口描述：
接口名称 	对方系统（外部系统或内部其他模块）	接口描述
客户信息接口	CRM系统	FOSS调用CRM客户信息接口，查询录入客户信息
电子地图接口	GIS系统	FOSS调用电子地图接口查询录入目的站、提货网点信息
库存接口	中转子系统	FOSS调用中转库存接口判断货物是否已签收出库
财务类变更接口	结算系统	FOSS调用该接口判断财务是否可发起财务类变更，
若财务对运单进行了锁定，则不可发起财务类变更


 */
/**--------------------------------------
 * 1.	纸包装件数默认显示数值等于货物总件数，
 * 营业员可以修改各包装的件数；
 * 系统自动在录入下一个包装前计算显示剩余未录入的件数，
 * 例：某票货物为50件，则自动显示纸包装50，
 * 在营业员修改纸包装为20时，木包装自动显示为30，
 * 在营业员修改木包装为10时，
 * 纤包装自动显示为20，该过程中未录入包装数值的默认显示为0；
2.	货物包装总件数小于等于货物总件数；
 */
/**--------------------------------------
 * 1.	离线开单时，不录入代打木架信息；
 * 当木包装件数大于等于1时，系统不提示任何信息，
 * 也不弹出代打木架录入界面；
2.	离线开单的代打木架信息在离线开单提交时，
系统校验提醒；
 */
/**
 * 1.	运输类型为汽运时，货物类型为唯一选择项；即，
 * 非A即B；默认不可勾选，
 * 只有当走货路由经过特定的城市时需要录入货物类型,
 * 特定城市可在系统中进行配置；
2.	运输类型为空
默认显示为普货，目前只有这一个分类，该类型可做配置；
--------------------------------------
 */
/**--------------------------------------
 * 1.	系统根据货物名称匹配生成的勾选贵重物品，
 * 营业员不可去掉勾选；
2.	营业员也可以主动勾选贵重物品；
3.	件数等于1、体积小于等于0.05个方、
报价声明价值大于等于10000元，为贵重物品；
系统自动勾选贵重物品，
营业员可修改是否勾选；
4.	件数大于等于2时，平均体积（体积/件数）
小于等于0.5方，平均声明价值（保价声明价值/件数）
大于等于10000元，为贵重物品；
系统自动勾选贵重物品，
营业员可修改是否勾选；
1.	营业部开单时按打完木架后的包装开，
即包装中含“木架/木箱”，
开单件数为货物打木架/木箱前的实际件数（防止丢货），
尺寸和重量按照以下公式计算：
1.1	整票货物代打时：
开单体积=代打货物体积*1.4；
开单重量=所有货物重量+代打货物体积*42；
1.2	部分货物代打时，
开单体积=代打货物体积*1.4+未打木架货物体积；
开单重量=所有货物重量+代打货物体积*42。
即：营业部按照代打货物未打木架之前体积的1.4倍来开单收费，
重量另加，单票中未打木架的货物的体积和重量不变；
1.3	例如：一票货物需全部代打，
货物体积为1个方，重量为100KG，
则开单体积为1.4个方，
开单重量为100+1*42=142KG，
收取客户包装费为150*1.4=210元；
1.4	需要加托时，仍按照50元/个另外收取费用，
托的重量和体积不再另加；
营业部不需要再更改由于打木架引起重量和体积的变化；
2.	开单件数为代打木架前货物实际件数，
包装为打木架后的包装，
打木架后件数发生变化后，
需及时更改件数；
--------------------------------------
 */

/**--------------------------------------
 * 每天处理的运单约为1000000单
营业员数量约10000名
系统一般要求
营业部、集中开单小组上班时间
营业部：16：00-20：00
集中开单小组：21：00-次日4：00
 */

/**--------------------------------------
 * 本界面为录入增值服务信息。
界面主要分为三个部分：
录入增值服务、
录入包装费、
查询其它费用。
1.	录入增值服务
录入增值服务分为两个部分：
录入增值服务信息界面、
录入其它费用列表；
1.1	录入增值服务信息界面
录入增值服务信息界面包括：
1.1.1	保价声明价值；
1.1.2	保价费率：
保价费率可由基础资料配置，
可按出发城市区域，
出发营业部等；
1.1.3	保价费；
1.1.4	代收货款；
1.1.5	代收费率；
1.1.6	代收手续费；
1.1.7	退款类型：
包括三日退、
退日退、
审核退，
默认三日退；
1.1.8	包装费；
1.1.9	装卸费；
1.1.10	送货费；
1.1.11	其它费用合计；
1.1.12	返单类别：
包括无需返单、
原件签收单返回、
传真件签收单返回、
扫描件返回，
默认无需返单；
1.1.13	预付费保密；
1.2	录入其它费用列表
录入其它费用列表包括：
1.2.1	费用名称；
1.2.2	费用金额；
1.2.3	新增其它费用：
功能按钮；
1.2.4	删除其它费用：
功能按钮；
2.	录入包装费
其界面和界面和需求详见系统用例“DP-FOSS-接送货系统用例-运单生成-确认承运信息-录入增值服务信息”中“录入包装费”；
3.	查询其它费用
其界面和界面和需求详见系统用例“DP-FOSS-接送货系统用例-运单生成-确认承运信息-录入增值服务信息”中“查询其它费用”；
--------------------------------------
 */
/**
 * /**--------------------------------------
 * 1.	若货物为违禁品，
 * 	则系统自动提示“货物为违禁品，不可开单！”；
 2.	若货物为拒收品，
 则系统自动提示“货物为拒收品，不可开单！”；
 3.	若货物为贵重物品，
 则系统自动勾选“贵重物品”，
 且不可修改；
 4.	若货物为限保物品，
 则系统自动限定保价金额，且不可修改，
 并提示“货物为限保物品”；
 5.	违禁品、拒收品、
 贵重物品、限保物品（含保价金额上限）
 具体类型可在系统中进行配置；
 1.	货物重量单位为千克
 */
/**--------------------------------------
 * 1.	货物尺寸为计算器输入，
 * 显示为输入文本；
2.	尺寸计算单位为厘米，
尺寸计算出数据后转换单位为立方米后，
在货物体积中显示数据；例如：
尺寸录入为：50*50*20，
则体积显示数据为：0.05；
 */
/**--------------------------------------
 * 1.	货物体积单位为立方米；
2.	营业员可以修改通过尺寸计算器
计算得出的体积数据；
3.	系统设置货物重量体积比区间值（该值由基础资料配置），
在运单提交时，
系统自动对重量体积比进行校验：
即重量体积比X=重量/体积；
3.1	当X不在设置的区间中，
弹出提示“请确认录入的重量体积是否准确！”；
（该弹窗有两个按钮：确定、取消）点击确定时，
弹出离线开单确认运单信息界面；点击取消，
点返回运单录入界面；
3.2	当X在区间中，无提示；
直接进入确认运单信息界面；
--------------------------------------
 */
/**--------------------------------------
 * 1.	纸包装件数默认显示数值等于货物总件数，
 * 营业员可以修改各包装的件数；
 * 系统自动在录入下一个包装前计算显示剩余未录入的件数，
 * 例：某票货物为50件，则自动显示纸包装50，
 * 在营业员修改纸包装为20时，木包装自动显示为30，
 * 在营业员修改木包装为10时，
 * 纤包装自动显示为20，该过程中未录入包装数值的默认显示为0；
2.	货物包装总件数小于等于货物总件数；
 */
/**--------------------------------------
 * 1.	离线开单时，不录入代打木架信息；
 * 当木包装件数大于等于1时，系统不提示任何信息，
 * 也不弹出代打木架录入界面；
2.	离线开单的代打木架信息在离线开单提交时，
系统校验提醒；
 */
/**
 * 1.	运输类型为汽运时，货物类型为唯一选择项；即，
 * 非A即B；默认不可勾选，
 * 只有当走货路由经过特定的城市时需要录入货物类型,
 * 特定城市可在系统中进行配置；
2.	运输类型为空
默认显示为普货，目前只有这一个分类，该类型可做配置；
--------------------------------------
 */
/**--------------------------------------
 * 1.	系统根据货物名称匹配生成的勾选贵重物品，
 * 营业员不可去掉勾选；
2.	营业员也可以主动勾选贵重物品；
3.	件数等于1、体积小于等于0.05个方、
报价声明价值大于等于10000元，为贵重物品；
系统自动勾选贵重物品，
营业员可修改是否勾选；
4.	件数大于等于2时，平均体积（体积/件数）
小于等于0.5方，平均声明价值（保价声明价值/件数）
大于等于10000元，为贵重物品；
系统自动勾选贵重物品，
营业员可修改是否勾选；
1.	营业部开单时按打完木架后的包装开，
即包装中含“木架/木箱”，
开单件数为货物打木架/木箱前的实际件数（防止丢货），
尺寸和重量按照以下公式计算：
1.1	整票货物代打时：
开单体积=代打货物体积*1.4；
开单重量=所有货物重量+代打货物体积*42；
1.2	部分货物代打时，
开单体积=代打货物体积*1.4+未打木架货物体积；
开单重量=所有货物重量+代打货物体积*42。
即：营业部按照代打货物未打木架之前体积的1.4倍来开单收费，
重量另加，单票中未打木架的货物的体积和重量不变；
1.3	例如：一票货物需全部代打，
货物体积为1个方，重量为100KG，
则开单体积为1.4个方，
开单重量为100+1*42=142KG，
收取客户包装费为150*1.4=210元；
1.4	需要加托时，仍按照50元/个另外收取费用，
托的重量和体积不再另加；
营业部不需要再更改由于打木架引起重量和体积的变化；
2.	开单件数为代打木架前货物实际件数，
包装为打木架后的包装，
打木架后件数发生变化后，
需及时更改件数；
--------------------------------------
 */

/**--------------------------------------
 * 每天处理的运单约为1000000单
营业员数量约10000名
系统一般要求
营业部、集中开单小组上班时间
营业部：16：00-20：00
集中开单小组：21：00-次日4：00
 */
package com.deppon.foss.module.pickup.changing.client.action;

import java.awt.event.ActionEvent;
import java.lang.reflect.InvocationTargetException;
import java.math.BigDecimal;
import java.util.ArrayList;
import java.util.Date;
import java.util.List;

import javax.swing.DefaultComboBoxModel;

import org.apache.commons.beanutils.BeanUtils;
import org.apache.commons.beanutils.PropertyUtils;
import org.apache.commons.lang.StringUtils;
import org.apache.log4j.Logger;

import com.deppon.foss.framework.client.commons.i18n.I18nManager;
import com.deppon.foss.framework.client.commons.i18n.II18n;
import com.deppon.foss.framework.client.commons.task.ITask;
import com.deppon.foss.framework.client.commons.task.ITaskContext;
import com.deppon.foss.framework.client.component.buttonaction.IButtonActionListener;
import com.deppon.foss.framework.client.component.dataaccess.GuiceContextFactroy;
import com.deppon.foss.framework.client.core.context.SessionContext;
import com.deppon.foss.framework.exception.BusinessException;
import com.deppon.foss.framework.shared.util.string.StringUtil;
import com.deppon.foss.module.base.baseinfo.api.shared.domain.CusBargainEntity;
import com.deppon.foss.module.base.baseinfo.api.shared.domain.OrgAdministrativeInfoEntity;
import com.deppon.foss.module.base.baseinfo.api.shared.domain.OuterBranchEntity;
import com.deppon.foss.module.base.baseinfo.api.shared.domain.SaleDepartmentEntity;
import com.deppon.foss.module.base.baseinfo.api.shared.domain.UserEntity;
import com.deppon.foss.module.base.baseinfo.api.shared.dto.CusLtDiscountItemDto;
import com.deppon.foss.module.base.baseinfo.api.shared.dto.CustomerCircleNewDto;
import com.deppon.foss.module.base.baseinfo.api.shared.dto.CustomerDto;
import com.deppon.foss.module.base.baseinfo.api.shared.dto.MarkActivitiesQueryConditionDto;
import com.deppon.foss.module.base.dict.api.shared.define.DictionaryValueConstants;
import com.deppon.foss.module.base.dict.api.shared.domain.DataDictionaryValueEntity;
import com.deppon.foss.module.mainframe.client.service.LongTaskService;
import com.deppon.foss.module.pickup.changing.client.service.IWaybillRfcService;
import com.deppon.foss.module.pickup.changing.client.service.WaybillRfcServiceFactory;
import com.deppon.foss.module.pickup.changing.client.ui.WaybillRFCUI;
import com.deppon.foss.module.pickup.changing.client.vo.TransportRecordVo;
import com.deppon.foss.module.pickup.changing.client.vo.WaybillInfoVo;
import com.deppon.foss.module.pickup.common.client.dto.OrgInfoDto;
import com.deppon.foss.module.pickup.common.client.service.IBaseDataService;
import com.deppon.foss.module.pickup.common.client.service.impl.BaseDataService;
import com.deppon.foss.module.pickup.common.client.utils.BZPartnersJudge;
import com.deppon.foss.module.pickup.common.client.utils.CommonUtils;
import com.deppon.foss.module.pickup.common.client.vo.BranchVo;
import com.deppon.foss.module.pickup.common.client.vo.DataDictionaryValueVo;
import com.deppon.foss.module.pickup.common.client.vo.OtherChargeVo;
import com.deppon.foss.module.pickup.common.client.vo.ProductEntityVo;
import com.deppon.foss.module.pickup.common.client.vo.ValueCopy;
import com.deppon.foss.module.pickup.common.client.vo.WaybillDiscountVo;
import com.deppon.foss.module.pickup.pricing.api.shared.define.PricingConstants.PriceEntityConstants;
import com.deppon.foss.module.pickup.pricing.api.shared.define.PricingConstants.ProductEntityConstants;
import com.deppon.foss.module.pickup.pricing.api.shared.domain.GoodsTypeEntity;
import com.deppon.foss.module.pickup.pricing.api.shared.domain.MinFeePlanEntity;
import com.deppon.foss.module.pickup.pricing.api.shared.domain.ProductEntity;
import com.deppon.foss.module.pickup.pricing.api.shared.dto.CarloadPricePlanDto;
import com.deppon.foss.module.pickup.pricing.api.shared.dto.QueryBillCacilateValueAddDto;
import com.deppon.foss.module.pickup.pricing.api.shared.dto.ValueAddDto;
import com.deppon.foss.module.pickup.waybill.shared.define.LabeledGoodChangeHistoryConstants;
import com.deppon.foss.module.pickup.waybill.shared.define.WaybillConstants;
import com.deppon.foss.module.pickup.waybill.shared.define.WaybillRfcConstants;
import com.deppon.foss.module.pickup.waybill.shared.domain.ActualFreightEntity;
import com.deppon.foss.module.pickup.waybill.shared.domain.WaybillDisDtlEntity;
import com.deppon.foss.module.pickup.waybill.shared.domain.WaybillEntity;
import com.deppon.foss.module.pickup.waybill.shared.domain.WoodenRequirementsEntity;
import com.deppon.foss.module.pickup.waybill.shared.dto.AddressFieldDto;
import com.deppon.foss.module.pickup.waybill.shared.dto.CrmActiveInfoDto;
import com.deppon.foss.module.pickup.waybill.shared.dto.EffectiveDto;
import com.deppon.foss.module.pickup.waybill.shared.dto.LabeledGoodChangeHistoryDto;
import com.deppon.foss.module.pickup.waybill.shared.dto.TransportRecordDto;
import com.deppon.foss.module.pickup.waybill.shared.dto.WaybillDto;
import com.deppon.foss.module.pickup.waybill.shared.dto.WaybillOtherChargeDto;
import com.deppon.foss.module.pickup.waybill.shared.dto.WaybillRfcImportDto;
import com.deppon.foss.module.pickup.waybill.shared.exception.WaybillValidateException;
import com.deppon.foss.module.pickup.waybill.shared.vo.CrmActiveParamVo;
import com.deppon.foss.util.define.FossConstants;

/**
 * 
 * 运单导入Action类
 * 
 * 
 * 下表为不能起草运单变更的类型及不能起草时系统提示内容
 * 
 * 序号	不能起草运单变更的类型	提示内容
 * 1	运单状态为“已保存待补录”的运单	运单未补录，不能起草运单变更！
 * 2	运单状态为“作废”、“中止”的运单	运单已作废，不能起草运单变更！
 * 运单已中止，不能起草运单变更！
 * 3	运单对应的收货部门与系统当前组织不一致	该单的收货部门不是您部门，不能起草运单变更！
 * 4	运单状态为“已签收”的运单	货物已签收，不能起草运单变更！
 * 5	变更单状态为“待审核”或“待受理”的运单	该运单有运单变更单还未被审核，不能起草变更运单！
 * 该运单有运单变更单还未被受理，不能起草变更运单！
 * 6	运单已进行结清货款操作	该运单已进行结清货款操作，如需更改请联系到达部门进行反结清货款操作！
 * 7	财务锁定的运单（财务将不允许发起变更的运单进行锁定）不能发起运单变更	该运单已被财务锁定，不能起草变更运单！
 * 8	偏线运单以外发	偏线运单已中转外发，不能起草运单变更！
 * 
 * 财务单据状态对运单更改限制条件												
 * 	说明：		以下总共有8大类结算操作会去修改运单的相关状态，当运单处于该状态下任何一种时，都不允许发生更改。									
 * 结算单据代码	结算单据名称	结算大类操作代码	结算大类操作名称	结算小类操作代码	结算小类操作名称	运单相关的财务单据状态字段名称	状态内容	描述	备注			
 * 	应收单		核销应收单		应收冲应付	应收单核销状态	应收冲应付核销中	与运单相关的应收单发生了应收冲应付核销操作，运单的应收单核销状态增加“应收冲应付核销中”				
 * 					还款冲应收		还款冲应收核销中	与运单相关的应收单发生了还款冲应收核销操作，运单的应收单核销状态增加“还款冲应收核销中”				
 * 					预收冲应收		预收冲应收核销中	与运单相关的应收单发生了预收冲应收核销操作，运单的应收单核销状态增加“预收冲应收核销中”				
 * 					坏账冲应收		坏账冲应收核销中	与运单相关的应收单发生了坏账冲应收核销操作，运单的应收单核销状态增加“坏账冲应收核销中”				
 * 			锁定应收单		锁定应收单	应收单锁定状态	网上支付应收单锁定中	与运单相关的应收单被网上支付时处于锁定状态，运单的应收单锁定状态被置为“网上支付应收单锁定中”				
 * 	应付单		生成应付单		偏线外发反馈录入	应付单生成状态	偏线外发反馈已录入	该运单已生成了偏线外发成本应付单，运单的应付单生成状态为“偏线外发反馈已录入”	偏线外发反馈录入			
 * 			生效应付单		生效代收货款应付单	应付单生效状态	代收货款应付单已生效	与运单相关的代收货款应付单生效时，运单的应付单生效状态增加“代收货款应付单已生效”	签收相关			
 * 					生效装卸费应付单		装卸费应付单已生效	与运单相关的装卸费应付单生效时，运单的应付单生效状态增加“代收货款应付单已生效”				
 * 					生效整车尾款应付单		整车尾款应付单已生效	与运单相关的装卸费应付单生效时，运单的应付单生效状态增加“整车尾款应付单已生效”				
 * 					生效长途外请车尾款应付单		长途外请车应付单已生效	与运单相关的装卸费应付单生效时，运单的应付单生效状态增加“长途外请车应付单已生效”				
 * 	核销应付单		应收冲应付	应付单核销状态	应收冲应付核销中	与运单相关的应付单发生了应收冲应付核销操作，运单的应收单核销状态增加“应收冲应付核销中”				
 * 					付款冲应付		付款冲应付核销中	与运单相关的应付单发生了付款冲应付核销操作，运单的应收单核销状态增加“付款冲应付核销中”				
 * 					预付冲应付		预付冲应付核销中	与运单相关的应收单发生了预付冲应付核销操作，运单的应收单核销状态增加“预付冲应付核销中”				
 * 			冻结应付单		冻结航空公司成本应付单	应付单冻结状态	航空公司成本应付单冻结中	与运单相关的航空公司成本应付单被冻结时，运单的应付单冻结状态增加“航空公司成本应付单冻结中”				
 * 					冻结航空出发代理应付单		航空出发代理应付单冻结中	与运单相关的航空出发代理应付单被冻结时，运单的应付单冻结状态增加“航空出发代理应付单冻结中”				
 * 					冻结航空中转代理应付单		航空中转代理应付单冻结中	与运单相关的航空中转代理应付单被冻结时，运单的应付单冻结状态增加“航空中转代理应付单冻结中”				
 * 					冻结航空到达代理成本应付单		航空到达代理成本应付单冻结中	与运单相关的航空到达代理成本应付单被冻结时，运单的应付单冻结状态增加“航空到达代理成本应付单冻结中”				
 * 	服务补救申请		异常流程申请		申请服务补救	运单异常申请状态	服务补救申请中	与运单相关的服务补救申请还未受理，运单的异常申请状态增加：“服务补救申请中”				
 * 							服务补救申请已受理	与运单相关的服务补救申请已受理，运单的异常申请状态增加：“服务补救申请已受理”				
 * 	退运费申请				申请退运费		退运费申请中	与运单相关的退运费申请还未受理，运单的异常申请状态增加：“退运费申请中”				
 * 							退运费申请已受理	与运单相关的退运费申请已受理，运单的异常申请状态增加：“退运费申请已受理”				
 * 	理赔申请				申请理赔		理赔申请中	与运单相关的理赔申请还未受理，运单的异常申请状态增加：“理赔申请中”				
 * 							理赔申请已受理	与运单相关的理赔申请已受理，运单的异常申请状态增加：“理赔申请已受理”				
 * 	坏账申请				申请坏账		坏账申请中	与运单相关的坏账申请还未受理，运单的异常申请状态增加：“坏账申请中”				
 * 							坏账申请已受理	与运单相关的坏账申请已受理，运单的异常申请状态增加：“坏账申请已受理”				
 * 	对账单明细		确认对账单		确认对账单	对账单确认状态	对账单已确认	当对账单明细包含有应收单和应付单时，且对账单已确认，则应收单和应付单关联的运单的对账单确认状态为：“对账单已确认”				
 * 
 * 
 * @author 102246-foss-shaohongliang
 * @date 2012-10-29 上午9:06:25
 */
public class WaybillImportAction implements IButtonActionListener<WaybillRFCUI> {

	/**
	 * log
	 */
	private static final Logger LOG = Logger.getLogger(WaybillImportAction.class);
	/**
	 * 国际化
	 */
	private static final II18n i18n = I18nManager.getI18n(WaybillImportAction.class);
	private static Logger logger = Logger.getLogger(WaybillImportAction.class);
	/**
	 * ui object
	 */
	private WaybillRFCUI waybillRFCUI;

	private WaybillRfcImportDto rfcImportDto = null;
	
	/**
	 * 更改单服务类统一入口
	 */
	private IWaybillRfcService waybillService = WaybillRfcServiceFactory
			.getWaybillRfcService();

	private IWaybillRfcService rfcService = WaybillRfcServiceFactory
			.getWaybillRfcService();

	private IBaseDataService baseDataService=GuiceContextFactroy.getInjector()
			.getInstance(BaseDataService.class);
	/**
	 * 
	 * 运单导入
	 * @author 102246-foss-shaohongliang
	 * @date 2012-12-24 下午5:25:22
	 * @see java.awt.event.ActionListener#actionPerformed(java.awt.event.ActionEvent)
	 */
	@Override
	public void actionPerformed(ActionEvent e) {
		// 获取UI上需要导入的运单号
		final String waybillNo = waybillRFCUI.getImportPanel().getTxtWaybillNo()
				.getText();
		rfcImportDto = null;
		if (StringUtil.isNotBlank(waybillNo)) {
				//创建耗时任务
				LongTaskService taskService = new LongTaskService();
				//执行耗时任务
				taskService.execute(i18n.get("foss.gui.changing.waybillImportAction.waybillImport.label"), new ITask() {
					@Override
					public void execute(ITaskContext context) throws Exception {
    					// 查询远程运单信息
						try{
							rfcImportDto = rfcService.importWaybillByNumber(waybillNo);
						}catch(Exception e){
							LOG.error("import waybill exception waybill_no:"+waybillNo, e);
							throw e;
						}
						/**
						 * 伙伴开单
						 */
						/*if (null != rfcImportDto && null != rfcImportDto.getWaybillDto() && null != rfcImportDto.getWaybillDto().getActualFreightEntity()) {
							if (FossConstants.YES.equals(rfcImportDto.getWaybillDto().getActualFreightEntity().getPartnerBillingLogo())) {
								MsgBox.showInfo(i18n.get("foss.gui.changing.waybillInfoBindingListener.exception.PartnerBillingLogo"));
								return;
							}
						}*/
						//运单无法导入的时候 不做任何操作
						if(null!=rfcImportDto){
							// 根据查询到的运单填充UI，如果运单为NULL，页面清空
	    					waybillRFCUI.importWaybill(translateToVO(rfcImportDto), true);
	    					//清空listener
	    					waybillRFCUI.getCompareListener().clearRfcChangeDetailMap();
	    					//如果是客户圈客户则将发货客户编码设置为从客户编码，为一般客户 将发货客户编码重新赋值
	    					waybillRFCUI.getBinderWaybill().setDeliveryCustomerCode(waybillRFCUI.getBinderWaybill().getOldDeliveryCustomerCode());					
	    				}
					}
				});
		}
		
	}

	/**
	 * 
	 * 转换运单信息DTO到VO
	 * 
	 * @author 102246-foss-shaohongliang
	 * @date 2012-11-2 上午8:36:05
	 */
	private WaybillInfoVo translateToVO(WaybillRfcImportDto rfcImportDto) {
		//订单类型
	   String serviceType = "";
		WaybillInfoVo waybillInfoVo = new WaybillInfoVo();
		if (rfcImportDto == null) {
			waybillInfoVo = waybillRFCUI.getBinderWaybill();
			waybillInfoVo.setWaybillNo(null);
			return waybillInfoVo;
		}
		String  orderNo = rfcImportDto.getWaybillDto().getWaybillEntity().getOrderNo();
		try {
			if(orderNo != null && !"".equals(orderNo)){
				serviceType = rfcService.queryServiceType(rfcImportDto.getWaybillDto().getWaybillEntity().getOrderNo());
			}
			waybillInfoVo.setServerType(serviceType);
			List<ProductEntity> list=null;
			//如果是自提件业务，则重新获取产品信息
			if(FossConstants.YES.equals(rfcImportDto.getWaybillDto().getWaybillEntity().getIsEconomyGoods())){
				String channelCode=rfcImportDto.getWaybillDto().getWaybillEntity().getEconomyGoodsType();
				Date billTime=rfcImportDto.getWaybillDto().getWaybillEntity().getBillTime();
				if(channelCode!=null){					
					//根据渠道CODE和当前时间获取产品信息
					list=WaybillRfcServiceFactory.getWaybillRfcService().getProductOfMinFeePlanByChannelCodeAndSpecifiedDate(channelCode, billTime);
				}				
			}else{
				list = WaybillRfcServiceFactory.getWaybillRfcService().queryTransType(rfcImportDto.getWaybillDto().getWaybillEntity().getReceiveOrgCode());	
			}			
			DefaultComboBoxModel productTypeModel = waybillRFCUI.getWaybillInfoPanel().getTransferPanel().getTransportInfoPanel().getProductTypeModel();
			if(list!=null && list.size()>0){
				productTypeModel.removeAllElements();
				//zxy 20140626 start 新增:精准大票运输性质过滤
				boolean isBigGoods = CommonUtils.isBigGoodsByProductCode(rfcImportDto.getWaybillDto().getWaybillEntity().getProductCode());
				waybillInfoVo.setIsBigGoods(isBigGoods);
				CommonUtils.filterBigGoodsProductEntity(list,isBigGoods);
				//zxy 20140626 end 新增:精准大票运输性质过滤
			}
			if(list!=null && list.size()>0){
				for (ProductEntity dataDictionary : list) {
					ProductEntityVo vo = new ProductEntityVo();
					
					if(CommonUtils.directDetermineIsExpressByProductCode(dataDictionary.getCode())){
						continue;
					}
					try {
						BeanUtils.copyProperties(vo, dataDictionary);
					} catch (IllegalAccessException e) {
						logger.error(e.getMessage());
					} catch (InvocationTargetException e) {
						logger.error(e.getMessage());
					}
					productTypeModel.addElement(vo);
				}
			}	
			
			WaybillDto wdto=rfcImportDto.getWaybillDto();
			
			// 原始运单
			waybillInfoVo.setWaybillDto(wdto);
			
			if(wdto!=null){
				ActualFreightEntity acf= wdto.getActualFreightEntity();
				if(acf!=null){
					String invoice =acf.getInvoice();
					if(WaybillConstants.INVOICE_01.equals(invoice)){
						waybillInfoVo.setInvoice(WaybillConstants.INVOICE_01);
						waybillInfoVo.setInvoiceTab(WaybillConstants.INVOICE_TYPE_01);
					}else{
						waybillInfoVo.setInvoice(WaybillConstants.INVOICE_02);
						waybillInfoVo.setInvoiceTab(WaybillConstants.INVOICE_TYPE_02);
					}
					//判定是否展会货物
					if(FossConstants.YES.equals(acf.getIsExhibitCargo())){
						waybillInfoVo.setIsExhibitCargo(true);
					}
					//设置【是否统一结算】 wutao
					if(acf.getStartCentralizedSettlement()!=null && !"".equals(acf.getStartCentralizedSettlement()) && FossConstants.YES.equals(acf.getStartCentralizedSettlement())){
						waybillInfoVo.setStartCentralizedSettlement(WaybillConstants.IS_NOT_NULL_FOR_AI);
					}else{
						waybillInfoVo.setStartCentralizedSettlement(WaybillConstants.IS_NULL_FOR_AI);
					}
					if(acf.getArriveCentralizedSettlement()!=null && !"".equals(acf.getArriveCentralizedSettlement()) && FossConstants.YES.equals(acf.getArriveCentralizedSettlement())){
						waybillInfoVo.setArriveCentralizedSettlement(WaybillConstants.IS_NOT_NULL_FOR_AI);
					}else{
						waybillInfoVo.setArriveCentralizedSettlement(WaybillConstants.IS_NULL_FOR_AI);
					}
					//【合同部门】
					if(acf.getStartContractOrgCode()!=null && !"".equals(acf.getStartContractOrgCode())){
						waybillInfoVo.setStartContractOrgName(CommonUtils.queryContractOrgName(acf.getStartContractOrgCode()));
					}else{
						waybillInfoVo.setStartContractOrgName(null);
					}
					if(acf.getArriveContractOrgCode()!=null && !"".equals(acf.getArriveContractOrgCode())){
						waybillInfoVo.setArriveContractOrgName(CommonUtils.queryContractOrgName(acf.getArriveContractOrgCode()));
					}else{
						waybillInfoVo.setArriveContractOrgName(null);
					}
					//【催款部门编码】
					waybillInfoVo.setStartReminderOrgCode(acf.getStartReminderOrgCode());
					waybillInfoVo.setArriveReminderOrgCode(acf.getArriveReminderOrgCode());
					//收货人地址备注
					if(StringUtils.isNotEmpty(acf.getReceiveCustomerAddressNote())){
						waybillInfoVo.setReceiveCustomerAddressNote(acf.getReceiveCustomerAddressNote());
					}
					//发货人地址备注
					if(StringUtils.isNotEmpty(acf.getDeliveryCustomerAddressNote())){
						waybillInfoVo.setDeliveryCustomerAddressNote(acf.getDeliveryCustomerAddressNote());
					}
					/**
					 * 将纸纤包装中的纸箱总价传入vo中
					 * @author:218371-foss-zhaoyanjun
					 * @date:2014-12-5下午15:41
					 */
					waybillInfoVo.setPaperBoxTotlePrice(acf.getPaperBoxTotlePrice());
					/**
					 * 将纸纤包装中的纤袋总价传入vo中
					 * @author:218371-foss-zhaoyanjun
					 * @date:2014-12-5下午15:41
					 */
					waybillInfoVo.setFibelBagTotlePrice(acf.getFibelBagTotlePrice());
					/**
					 * 将纸纤包装中的其它总价传入vo中
					 * @author:218371-foss-zhaoyanjun
					 * @date:2014-12-5下午15:41
					 */
					waybillInfoVo.setOtherTotle(acf.getOtherTotle());
					/**
					 * 将纸纤包装中的总价传入vo中
					 * @author:218371-foss-zhaoyanjun
					 * @date:2014-12-5下午15:41
					 */
					waybillInfoVo.setPackingTotle(acf.getPackingTotle());
					/**
					 * 将交易流水号带出
					 * @author:218371-foss-zhaoyanjun
					 * @date:2015-03-26下午14:18
					 */
					waybillInfoVo.setTransactionSerialNumber(acf.getTransactionSerialNumber());
					/**
					 * Dmana-9885将巨商汇客户的原始运费带出
					 * @author:218371-foss-zhaoyanjun
					 * @date:2015-02-07上午11:08
					 */
					waybillInfoVo.setCrmTransportFee(acf.getCrmTransportFee());
					/**
					 * Dmana-9885将巨商汇客户的原始重量带出
					 * @author:218371-foss-zhaoyanjun
					 * @date:2015-02-07上午11:13
					 */
					waybillInfoVo.setCrmWeight(acf.getCrmWeight());
					/**
					 * Dmana-9885将巨商汇客户的原始体积带出
					 * @author:218371-foss-zhaoyanjun
					 * @date:2015-02-07上午11:13
					 */
					waybillInfoVo.setCrmVolume(acf.getCrmVolume());
					/**
					 * 内部发货类型和工号
					 */
					waybillInfoVo.setInternalDeliveryType(dataDictionaryValueEntityToVo(
							WaybillConstants.INTERNAL_DELIVERY_TYPE,
							acf.getInternalDeliveryType()));
					waybillInfoVo.setEmployeeNo(acf.getEmployeeNo());
					if(StringUtil.isNotBlank(acf.getEmployeeNo())) {
						waybillInfoVo.setOriginalEmployeeNo(acf.getEmployeeNo());
					}
					/**
					 * 特殊增值服务类型
					 * 254615-foss-mabinliang
					 */
					waybillInfoVo.setSpecialValueAddedServiceType(dataDictionaryValueEntityToVo(
							WaybillConstants.SPECIAL_VALUE_ADDED_SERVICE_TYPE,
							acf.getSpecialValueAddedServiceType()));
					
					/**
					 * zhangchengfu
					 * 行业货源品类
					 */
					if (StringUtil.isNotBlank(acf.getIndustrySourceCategory())) {
						waybillInfoVo.setIndustrySourceCategory(dataDictionaryValueEntityToVo(WaybillConstants.BSE_SOURCE_CATEGORY, acf.getIndustrySourceCategory()));
					}
					/**
					 * zhangchengfu
					 * 客户分群
					 */
					String flabelleavemonth = acf.getFlabelleavemonth();
					if (StringUtil.isEmpty(acf.getFlabelleavemonth())) {
						flabelleavemonth = "NEWCUST";
					}
					//是否批量开单 开的单 --sangwenhao
					if(StringUtils.isNotBlank(acf.getIsBatchCreateWaybill()) && StringUtils.equals(WaybillConstants.YES, acf.getIsBatchCreateWaybill())){
						waybillRFCUI.setBatchWaybill(true);
					}
					waybillInfoVo.setFlabelleavemonth(dataDictionaryValueEntityToVo(WaybillConstants.CRM_CUSTOMER_GROUP, flabelleavemonth));
					//运单类型
					waybillInfoVo.setWaybillType(acf.getWaybillType()) ;
				}else{
					waybillInfoVo.setInvoice(WaybillConstants.INVOICE_02);
					waybillInfoVo.setInvoiceTab(WaybillConstants.INVOICE_TYPE_02);
				}
			}else{
				waybillInfoVo.setInvoice(WaybillConstants.INVOICE_02);
				waybillInfoVo.setInvoiceTab(WaybillConstants.INVOICE_TYPE_02);
			}
			if(wdto != null && wdto.getActualFreightEntity() != null && FossConstants.YES.equals(wdto.getActualFreightEntity().getBigTicketGoods())){
				waybillInfoVo.setBigTicket(true);
			}else{
				waybillInfoVo.setBigTicket(false);
			}
			
			WaybillEntity waybillEntity = rfcImportDto.getWaybillDto()
					.getWaybillEntity();
			waybillInfoVo.setOriginalCode(waybillEntity.getDeliveryCustomerCode());
			waybillInfoVo.setOriginalTotalFee(waybillEntity.getTotalFee());
			waybillInfoVo.setOriginalFee(waybillEntity.getPromotionsFee());
			waybillInfoVo.getWaybillDto().getWaybillEntity().setOriginalEmployeeNo(waybillInfoVo.getOriginalEmployeeNo());
			waybillInfoVo.getWaybillDto().getWaybillEntity().setOriginalFee(waybillInfoVo.getOriginalFee());
			// 运输性质
			ProductEntityVo productEntityVo = getProductTypeByCode(
					waybillEntity.getProductCode(),
					waybillEntity.getCreateTime());
			
			WoodenRequirementsEntity woodenRequirementsEntity = rfcImportDto
					.getWaybillDto().getWoodenRequirementsEntity();
			// 货物状态
			if (rfcImportDto.getStockStatus() != null) {
				waybillInfoVo.setGoodsStatus(dataDictionaryValueEntityToVo(
						WaybillRfcConstants.STOCK_STATUS, rfcImportDto
								.getStockStatus().getResult()));
				waybillInfoVo.setStockStatus(rfcImportDto.getStockStatus());
			}
			// 转货记录
			List<TransportRecordDto> transportRecordDtos = rfcImportDto
					.getTransportRecordDtos();
			List<TransportRecordVo> transferRecords = new ArrayList<TransportRecordVo>();
			List<TransportRecordVo> returnRecords = new ArrayList<TransportRecordVo>();
			List<TransportRecordVo> transportRecords = new ArrayList<TransportRecordVo>();
			TransportRecordVo finalTransportRecordBeforeChange = null;
			for (TransportRecordDto recordDto : transportRecordDtos) {
				TransportRecordVo recordVo = new TransportRecordVo();
				recordVo.setBillingType(dataDictionaryValueEntityToVo(
						WaybillConstants.BILLING_WAY,
						recordDto.getBillingType()));

				// 提货网点
				if (ProductEntityConstants.PRICING_PRODUCT_AIR_FREIGHT
						.equals(recordDto.getProductCode())
						|| ProductEntityConstants.PRICING_PRODUCT_PARTIAL_LINE
								.equals(recordDto.getProductCode())) {
					//偏线空运
					Date billTime = new Date();
					if(wdto != null && wdto.getActualFreightEntity() != null){
						billTime = wdto.getActualFreightEntity().getCreateTime();
					}
					OuterBranchEntity selectedOuterBranchEntity = rfcService
							.queryOuterBranchByCode(recordDto.getCustomerPickupOrgCode(), billTime);
					if (selectedOuterBranchEntity != null) {
						BranchVo branchVO = new BranchVo();
						//网点编号
						branchVO.setCode(selectedOuterBranchEntity
								.getAgentDeptCode());
						//网点名称
						branchVO.setName(selectedOuterBranchEntity
								.getAgentDeptName());
						//是否送货上门
						branchVO.setDelivery(selectedOuterBranchEntity.getPickupToDoor());
						//是否可自提
						branchVO.setPickupSelf(selectedOuterBranchEntity.getPickupSelf());
						
						//部门城市code
						branchVO.setCityCode(selectedOuterBranchEntity.getCityCode());
						//提货网点
						recordVo.setCustomerPickupOrgCode(branchVO);
						//提货网点名称
						recordVo.setCustomerPickupOrgName(branchVO.getName());
						
					}
				} else {
					//自有营业部
					SaleDepartmentEntity selectedSaleDepartmentInfo = rfcService
							.querySaleDepartmentByCode(recordDto.getCustomerPickupOrgCode());
					if (selectedSaleDepartmentInfo != null) {
						BranchVo branchVO = new BranchVo();
						//网点编号
						branchVO.setCode(selectedSaleDepartmentInfo.getCode());
						//网点名称
						branchVO.setName(selectedSaleDepartmentInfo.getName());
						//单票重量上限
						branchVO.setSingleBillLimitkg(selectedSaleDepartmentInfo
								.getSingleBillLimitkg());
						//单票体积上限
						branchVO.setSingleBillLimitvol(selectedSaleDepartmentInfo
								.getSingleBillLimitvol());
						//单件重量上限
						branchVO.setSinglePieceLimitkg(selectedSaleDepartmentInfo
								.getSinglePieceLimitkg());
						//单件体积上限
						branchVO.setSinglePieceLimitvol(selectedSaleDepartmentInfo
								.getSinglePieceLimitvol());
						//是否送货上门
						branchVO.setDelivery(selectedSaleDepartmentInfo.getDelivery());
						//是否可自提
						branchVO.setPickupSelf(selectedSaleDepartmentInfo.getPickupSelf());
						//所属城市
						OrgAdministrativeInfoEntity infoEntity =rfcService.queryByCode(selectedSaleDepartmentInfo.getCode());
						if(infoEntity!=null){
							branchVO.setCityCode(infoEntity.getCityCode());
						}					
						//提货网点
						recordVo.setCustomerPickupOrgCode(branchVO);
						//提货网点名称
						recordVo.setCustomerPickupOrgName(branchVO.getName());
					}
				}
				//预配航班
				recordVo.setFlightNumberType(dataDictionaryValueEntityToVo(
						WaybillConstants.AIR_FLIGHT_TYPE, recordDto.getFlightNumberType()));
				
				//合票方式
				recordVo.setFreightMethod(dataDictionaryValueEntityToVo(
						WaybillConstants.MAKE_WAYBILL_WAY, recordDto.getFreightMethod()));
				//航班时间 
				recordVo.setFlightShift(recordDto.getFlightShift());
				//运输性质
				recordVo.setProductCode(getProductTypeByCode(
						recordDto.getProductCode(),
						waybillEntity.getCreateTime()));
				/**
				 * 提货方式
				 * 若有特殊增值服务，则根据特殊增值服务选择提货方式
				 * 反之则根据运输性质来选择提货方式
				 */ 
				if(waybillInfoVo.getSpecialValueAddedServiceType()!=null){
					   recordVo.setReceiveMethod(dataDictionaryValueEntityToVo(
										WaybillConstants.SPECIAL_DELIVERY_TYPE,
										waybillEntity.getReceiveMethod()));
				}else if (productEntityVo != null) {
					if (ProductEntityConstants.PRICING_PRODUCT_AIR_FREIGHT
							.equals(productEntityVo.getCode())) {
						recordVo
								.setReceiveMethod(dataDictionaryValueEntityToVo(
										WaybillConstants.PICKUP_GOODS_AIR,
										waybillEntity.getReceiveMethod()));
					} else {
						recordVo
								.setReceiveMethod(dataDictionaryValueEntityToVo(
										WaybillConstants.PICKUP_GOODS_HIGHWAYS,
										waybillEntity.getReceiveMethod()));
					}
				}
				
			
				//目的站
				recordVo.setTargetOrgCode(recordDto.getTargetOrgCode());
				
				
				//运费
				recordVo.setTransportFee(recordDto.getTransportFee());
				//费率
				recordVo.setUnitPrice(recordDto.getUnitPrice());
				if (WaybillRfcConstants.TRANSFER.equals(recordDto.getRfcType())) {//转货
					transferRecords.add(recordVo);
					transportRecords.add(recordVo);
				}else if (WaybillRfcConstants.RETURN.equals(recordDto.getRfcType())){
					returnRecords.add(recordVo);
					transportRecords.add(recordVo);
				}else{
					//运费
					recordVo.setTransportFee(waybillEntity.getTransportFee());
					//费率
					recordVo.setUnitPrice(waybillEntity.getUnitPrice());
					
					finalTransportRecordBeforeChange = recordVo;
				}
			}
			

			List<WaybillDiscountVo> data=new ArrayList<WaybillDiscountVo>();
			if(rfcImportDto.getWaybillDto().getWaybillDisDtlEntity()!=null)
			{
				for(WaybillDisDtlEntity waybillDisDtlEntity:rfcImportDto.getWaybillDto().getWaybillDisDtlEntity())
				{
					WaybillDiscountVo vo = new WaybillDiscountVo();
					// 折扣ID
					vo.setDiscountId(waybillDisDtlEntity.getDicountId());
					// 费用类型id
					vo.setChargeDetailId(waybillDisDtlEntity.getWaybillChargeDetailId());
					//优惠项目名称
					vo.setFavorableItemName(waybillDisDtlEntity.getPricingEntryName());
					//优惠项目CODE
					vo.setFavorableItemCode(waybillDisDtlEntity.getPricingEntryCode());
					//优惠项目名称
					vo.setFavorableTypeName(waybillDisDtlEntity.getTypeName());
					//优惠项目CODE
					vo.setFavorableTypeCode(waybillDisDtlEntity.getType());
					//优惠项目名称
					vo.setFavorableSubTypeName(waybillDisDtlEntity.getSubTypeName());
					//优惠项目CODE
					vo.setFavorableSubTypeCode(waybillDisDtlEntity.getSubType());
					//营销活动
					vo.setActiveCode(waybillDisDtlEntity.getActiveCode());
					vo.setActiveName(waybillDisDtlEntity.getActiveName());
					vo.setActiveStartTime(waybillDisDtlEntity.getActiveStartTime());
					vo.setActiveEndTime(waybillDisDtlEntity.getActiveEndTime());
					vo.setOptionsCrmId(waybillDisDtlEntity.getOptionsCrmId());
					if (waybillDisDtlEntity.getRate() != null) {
						// 优惠折扣率
						vo.setFavorableDiscount(waybillDisDtlEntity.getRate().toString());
					} 
					// 优惠折扣金额
					if (waybillDisDtlEntity.getAmount() != null) {
						//优惠金额
						vo.setFavorableAmount(waybillDisDtlEntity.getAmount().toString());			
					}
					data.add(vo);
				}
			}
			
			waybillInfoVo.setWaybillDiscountVos(data);
			//导入时的折扣信息
			waybillInfoVo.setImportWaybillDiscountVos(data);
			waybillInfoVo.setTransferRecordList(transferRecords);
			// 返货记录
			waybillInfoVo.setReturnRecordList(returnRecords);
			// 变更记录
			transportRecords.add(0, finalTransportRecordBeforeChange);
			waybillInfoVo.setTransportRecordList(transportRecords);
			//初始化手动费
			waybillInfoVo.setHandDeliveryFee(waybillEntity.getDeliveryGoodsFee());

			// 运单实体ID
			waybillInfoVo.setId(waybillEntity.getId());
			// 运单号
			waybillInfoVo.setWaybillNo(waybillEntity.getWaybillNo());
			// 订单号
			waybillInfoVo.setOrderNo(waybillEntity.getOrderNo());
			
			waybillInfoVo.setTransferStartOrgCode(waybillEntity.getTransferStartOrgCode());
			waybillInfoVo.setTransferStartOrgName(waybillEntity.getTransferStartOrgName());
			
			/**
			 * 订单渠道
			 */
			waybillInfoVo.setOrderChannel(waybillEntity.getOrderChannel());
			
			/**
			 * 订单付款方式
			 */
			waybillInfoVo.setOrderPayment(waybillEntity.getOrderPaidMethod());
			
			
			// 发货客户ID
			waybillInfoVo.setDeliveryCustomerId(waybillEntity
					.getDeliveryCustomerId());
			// 发货客户联系人ID
			waybillInfoVo.setDeliveryCustomerContactId(waybillEntity
					.getDeliverCustContactId());
			// 发货客户编码
			waybillInfoVo.setDeliveryCustomerCode(waybillEntity
					.getDeliveryCustomerCode());
			// 是否精准包裹
			waybillInfoVo.setIsAccuratePackage(waybillEntity.getDeliveryCustomerIsAccuratePackage());
			// 大客户标记
			waybillInfoVo.setDeliveryBigCustomer(waybillEntity.getDeliveryBigCustomer());
			// 发货客户名称
			waybillInfoVo.setDeliveryCustomerName(waybillEntity
					.getDeliveryCustomerName());
			// 发货客户手机
			waybillInfoVo.setDeliveryCustomerMobilephone(waybillEntity
					.getDeliveryCustomerMobilephone());
			// 发货客户电话
			waybillInfoVo.setDeliveryCustomerPhone(waybillEntity
					.getDeliveryCustomerPhone());
			// 发货客户联系人
			waybillInfoVo.setDeliveryCustomerContact(waybillEntity
					.getDeliveryCustomerContact());
			// 发货国家
			waybillInfoVo.setDeliveryCustomerNationCode(waybillEntity
					.getDeliveryCustomerNationCode());
			// 发货省份
			waybillInfoVo.setDeliveryCustomerProvCode(waybillEntity
					.getDeliveryCustomerProvCode());
			// 发货市
			waybillInfoVo.setDeliveryCustomerCityCode(waybillEntity
					.getDeliveryCustomerCityCode());
			// 发货区
			waybillInfoVo.setDeliveryCustomerDistCode(waybillEntity
					.getDeliveryCustomerDistCode());
			// 国家省市区
			AddressFieldDto deliveryAddress = getProvCityCounty(
					waybillEntity.getDeliveryCustomerNationCode(),
					waybillEntity.getDeliveryCustomerProvCode(),
					waybillEntity.getDeliveryCustomerCityCode(),
					waybillEntity.getDeliveryCustomerDistCode());
			waybillInfoVo.setDeliveryCustomerAreaDto(deliveryAddress);
			waybillInfoVo.setDeliveryCustomerArea(getAddressText(deliveryAddress));

			// 发货具体地址
			waybillInfoVo.setDeliveryCustomerAddress(waybillEntity
					.getDeliveryCustomerAddress());
			
			// 收货客户ID
			waybillInfoVo.setReceiveCustomerId(waybillEntity
					.getReceiveCustomerId());
			// 收货联系人ID
			waybillInfoVo.setReceiveCustomerContactId(waybillEntity
					.getReceiverCustContactId());
			// 收货客户编码
			waybillInfoVo.setReceiveCustomerCode(waybillEntity
					.getReceiveCustomerCode());
			//大客户标记
			waybillInfoVo.setReceiveBigCustomer(waybillEntity
					.getReceiveBigCustomer());
			// 收货客户名称
			waybillInfoVo.setReceiveCustomerName(waybillEntity
					.getReceiveCustomerName());
			// 收货客户手机
			waybillInfoVo.setReceiveCustomerMobilephone(waybillEntity
					.getReceiveCustomerMobilephone());
			// 收货客户电话
			waybillInfoVo.setReceiveCustomerPhone(waybillEntity
					.getReceiveCustomerPhone());
			// 收货客户联系人
			waybillInfoVo.setReceiveCustomerContact(waybillEntity
					.getReceiveCustomerContact());
			// 收货国家
			waybillInfoVo.setReceiveCustomerNationCode(waybillEntity
					.getReceiveCustomerNationCode());
			// 收货省份
			waybillInfoVo.setReceiveCustomerProvCode(waybillEntity
					.getReceiveCustomerProvCode());
			// 收货市
			waybillInfoVo.setReceiveCustomerCityCode(waybillEntity
					.getReceiveCustomerCityCode());
			// 收货区
			waybillInfoVo.setReceiveCustomerDistCode(waybillEntity
					.getReceiveCustomerDistCode());
			// 国家省市区
			AddressFieldDto receiveAddress = getProvCityCounty(
					waybillEntity.getReceiveCustomerNationCode(),
					waybillEntity.getReceiveCustomerProvCode(),
					waybillEntity.getReceiveCustomerCityCode(),
					waybillEntity.getReceiveCustomerDistCode());
			waybillInfoVo.setReceiveCustomerAreaDto(receiveAddress);
			waybillInfoVo.setReceiveCustomerArea(getAddressText(receiveAddress));
			
			// 收货具体地址
			waybillInfoVo.setReceiveCustomerAddress(waybillEntity
					.getReceiveCustomerAddress());

			// 收货部门
			waybillInfoVo.setReceiveOrgCode(waybillEntity.getReceiveOrgCode());
			//货部门省份编码
			if(StringUtil.isNotEmpty(waybillEntity.getReceiveOrgCode())){
				waybillInfoVo.setReceiveOrgProvCode(CommonUtils.getReceiveOrgProvCode(waybillEntity.getReceiveOrgCode()));
			}
			//约车编号
			waybillInfoVo.setVehicleNumber(waybillEntity.getOrderVehicleNum());
			// 收货部门名称
			waybillInfoVo.setReceiveOrgName(rfcService
					.queryDeptNameByCode(waybillEntity.getReceiveOrgCode()));
			
			// 开单时间
			waybillInfoVo.setBillTime(waybillEntity.getBillTime());
			waybillInfoVo.setProductCode(productEntityVo);
			
			//先将实际客户编码保存起来
			waybillInfoVo.setOldDeliveryCustomerCode(waybillInfoVo.getDeliveryCustomerCode());
			//如果导入之后直接计算总运费会调用这段代码，重新调用接口给bean赋值
			CustomerCircleNewDto customerCircleNewDto = waybillService.queryCustomerByCusCode(waybillInfoVo.getDeliveryCustomerCode(), waybillInfoVo.getBillTime(), "N");
			if(customerCircleNewDto!=null &&StringUtil.isNotEmpty(customerCircleNewDto.getIsCustCircle()) &&
					StringUtil.equals("Y", customerCircleNewDto.getIsCustCircle()) && 
					customerCircleNewDto.getCustomerCircleEntity() != null &&
					customerCircleNewDto.getCusBargainNewEntity() != null  &&
					customerCircleNewDto.getCustomerNewEntity() !=null){
				waybillInfoVo.setIsCircle(customerCircleNewDto.getIsCustCircle() !=null ? customerCircleNewDto.getIsCustCircle() :"");
				waybillInfoVo.setCusBargainNewEntity(customerCircleNewDto.getCusBargainNewEntity());
				waybillInfoVo.setCustomerNewEntity(customerCircleNewDto.getCustomerNewEntity());
				waybillInfoVo.setCustomerCircleEntity(customerCircleNewDto.getCustomerCircleEntity());
				//是否精准包裹
				waybillInfoVo.setIsAccuratePackage(customerCircleNewDto.getCusBargainNewEntity().getIsAccuratePackage() !=null ? customerCircleNewDto.getCusBargainNewEntity().getIsAccuratePackage() :"");
				//合同编码
				waybillInfoVo.setAuditNo(customerCircleNewDto.getCusBargainNewEntity().getBargainCode() !=null ? customerCircleNewDto.getCusBargainNewEntity().getBargainCode() :"");
				//主客户编码
				waybillInfoVo.setDeliveryCustomerCode(customerCircleNewDto.getCustomerCircleEntity().getCustCode());
				//合同部门的标杆名称
				waybillInfoVo.setStartContractOrgName(customerCircleNewDto.getCusBargainNewEntity().getApplicateOrgName() !=null ? customerCircleNewDto.getCusBargainNewEntity().getApplicateOrgName():"");
				//合同部门的标杆编码
				waybillInfoVo.setStartContractOrgCode(customerCircleNewDto.getCusBargainNewEntity().getUnifiedCode() !=null ? customerCircleNewDto.getCusBargainNewEntity().getUnifiedCode():"");
				//催款部门的标杆编码
				waybillInfoVo.setStartReminderOrgCode(customerCircleNewDto.getCusBargainNewEntity().getHastenfunddeptCode() !=null ? customerCircleNewDto.getCusBargainNewEntity().getHastenfunddeptCode():"");
			}else{
				waybillInfoVo.setIsCircle("N");
			}
			/**
			 * 提货方式
			 * 若有特殊增值服务，则根据特殊增值服务选择提货方式
			 * 反之则根据运输性质来选择提货方式
			 */
			if(waybillInfoVo.getSpecialValueAddedServiceType()!=null){
				waybillInfoVo.setReceiveMethod(dataDictionaryValueEntityToVo(
									WaybillConstants.SPECIAL_DELIVERY_TYPE,
									waybillEntity.getReceiveMethod()));
			}else if (waybillInfoVo.getSpecialValueAddedServiceType()==null&&productEntityVo != null) {
				if (ProductEntityConstants.PRICING_PRODUCT_AIR_FREIGHT
						.equals(productEntityVo.getCode())) {
					waybillInfoVo
							.setReceiveMethod(dataDictionaryValueEntityToVo(
									WaybillConstants.PICKUP_GOODS_AIR,
									waybillEntity.getReceiveMethod()));
				} else {
					waybillInfoVo
							.setReceiveMethod(dataDictionaryValueEntityToVo(
									WaybillConstants.PICKUP_GOODS_HIGHWAYS,
									waybillEntity.getReceiveMethod()));
				}
			}
				
				// 提货网点
				if (ProductEntityConstants.PRICING_PRODUCT_AIR_FREIGHT
						.equals(productEntityVo.getCode())
						|| ProductEntityConstants.PRICING_PRODUCT_PARTIAL_LINE
								.equals(productEntityVo.getCode())) {
					//偏线空运
					OuterBranchEntity selectedOuterBranchEntity = rfcService
							.queryExsitAgencyBranchCompanyInfo(waybillEntity
									.getCustomerPickupOrgCode());
					if (selectedOuterBranchEntity != null) {
						BranchVo branchVO = new BranchVo();
						//网点编号
						branchVO.setCode(selectedOuterBranchEntity
								.getAgentDeptCode());
						//网点名称
						branchVO.setName(selectedOuterBranchEntity
								.getAgentDeptName());
						//是否送货上门
						branchVO.setDelivery(selectedOuterBranchEntity.getPickupToDoor());
						//是否可自提
						branchVO.setPickupSelf(selectedOuterBranchEntity.getPickupSelf());
						
						//部门城市code
						branchVO.setCityCode(selectedOuterBranchEntity.getCityCode());
						//提货网点
						waybillInfoVo.setCustomerPickupOrgCode(branchVO);
						//提货网点名称
						waybillInfoVo.setCustomerPickupOrgName(branchVO.getName());
						//设置是否可以开代收货款
						waybillInfoVo.setCanAgentCollected(selectedOuterBranchEntity.getHelpCharge());
						//设置是否可以货到付款
						waybillInfoVo.setArriveCharge(selectedOuterBranchEntity.getArriveCharge());
					}
				} else {
					//自有营业部
					SaleDepartmentEntity selectedSaleDepartmentInfo = rfcService
							.queryExsitSaleDepartmentByCode(waybillEntity
									.getCustomerPickupOrgCode());
					if (selectedSaleDepartmentInfo != null) {
						OrgAdministrativeInfoEntity infoEntity =rfcService.queryByCode(waybillEntity
								.getCustomerPickupOrgCode());
						BranchVo branchVO = new BranchVo();
						//网点编号
						branchVO.setCode(selectedSaleDepartmentInfo.getCode());
						//网点名称
						branchVO.setName(selectedSaleDepartmentInfo.getName());
						//单票重量上限
						branchVO.setSingleBillLimitkg(selectedSaleDepartmentInfo
								.getSingleBillLimitkg());
						//单票体积上限
						branchVO.setSingleBillLimitvol(selectedSaleDepartmentInfo
								.getSingleBillLimitvol());
						//单件重量上限
						branchVO.setSinglePieceLimitkg(selectedSaleDepartmentInfo
								.getSinglePieceLimitkg());
						//单件体积上限
						branchVO.setSinglePieceLimitvol(selectedSaleDepartmentInfo
								.getSinglePieceLimitvol());
						//是否送货上门
						branchVO.setDelivery(selectedSaleDepartmentInfo.getDelivery());
						//是否可自提
						branchVO.setPickupSelf(selectedSaleDepartmentInfo.getPickupSelf());
						//自由提货网点所属的城市code
						if(infoEntity!=null){
							branchVO.setCityCode(infoEntity.getCityCode());
						}
						//提货网点
						waybillInfoVo.setCustomerPickupOrgCode(branchVO);
						//提货网点名称
						waybillInfoVo.setCustomerPickupOrgName(branchVO.getName());
						//设置是否可以开代收货款
						waybillInfoVo.setCanAgentCollected(selectedSaleDepartmentInfo.getCanAgentCollected());
						//设置是否可以货到付款
						waybillInfoVo.setArriveCharge(selectedSaleDepartmentInfo.getCanCashOnDelivery());
					}
				}
			
			if(waybillInfoVo.getCustomerPickupOrgCode()==null){
				throw new WaybillValidateException(i18n.get("foss.gui.creating.calculateAction.msgBox.nullCustomerPickupOrgCode",waybillEntity
						.getCustomerPickupOrgCode()));
			}
			
			// 配载类型
			waybillInfoVo.setLoadMethod(waybillEntity.getLoadMethod());
			// 目的站
			waybillInfoVo.setTargetOrgCode(waybillEntity.getTargetOrgCode());
			// 是否上门接货
			waybillInfoVo.setPickupToDoor(FossConstants.YES
					.equals(waybillEntity.getPickupToDoor()));
			// 是否免费接货
			waybillInfoVo.setFreePickupGoods(FossConstants.YES
					.equals(waybillEntity.getFreePickupGoods()));
			// 司机
			waybillInfoVo.setDriverCode(waybillEntity.getDriverCode());
			// 是否集中接货
			waybillInfoVo.setPickupCentralized(FossConstants.YES
					.equals(waybillEntity.getPickupCentralized()));
			// 配载线路
			waybillInfoVo.setLoadLineCode(waybillEntity.getLoadLineCode());
			// 配载部门
			waybillInfoVo.setLoadOrgCode(waybillEntity.getLoadOrgCode());
			// 最终配载部门
			waybillInfoVo
					.setLastLoadOrgCode(waybillEntity.getLastLoadOrgCode());
			// 预计出发时间
			waybillInfoVo.setPreDepartureTime(waybillEntity
					.getPreDepartureTime());
			// 预计派送/提货时间
			waybillInfoVo.setPreCustomerPickupTime(waybillEntity
					.getPreCustomerPickupTime());
			// 是否大车直送
			waybillInfoVo.setCarDirectDelivery(FossConstants.YES
					.equals(waybillEntity.getCarDirectDelivery()));
			// 货物名称
			waybillInfoVo.setGoodsName(waybillEntity.getGoodsName());
			// 货物总件数
			waybillInfoVo.setGoodsQtyTotal(waybillEntity.getGoodsQtyTotal());
			// 货物总重量
			waybillInfoVo.setGoodsWeightTotal(waybillEntity
					.getGoodsWeightTotal());
			// 货物总体积
			waybillInfoVo.setGoodsVolumeTotal(waybillEntity
					.getGoodsVolumeTotal());
			// 货物尺寸
			waybillInfoVo.setGoodsSize(waybillEntity.getGoodsSize());
			
			//航空货物类型
			if(ProductEntityConstants.PRICING_PRODUCT_AIR_FREIGHT.equals(waybillEntity.getProductCode())){
				//设置空运类型
				setAirGoodType(waybillInfoVo, waybillEntity);
			
			}else{
				//普通
				// 货物类型
				waybillInfoVo.setGoodsType(waybillEntity.getGoodsTypeCode());
			}
			
			// 是否贵重物品
			waybillInfoVo.setPreciousGoods(FossConstants.YES
					.equals(waybillEntity.getPreciousGoods()));
			// 是否异形物品
			waybillInfoVo.setSpecialShapedGoods(FossConstants.YES
					.equals(waybillEntity.getSpecialShapedGoods()));
			// 对外备注
			waybillInfoVo.setOuterNotes(dataDictionaryValueEntityToVo(
					WaybillConstants.OUTER_REMARK,
					waybillEntity.getOuterNotes()));
			// 对内备注
			waybillInfoVo.setInnerNotes(waybillEntity.getInnerNotes());
			// 储运事项
			if(waybillEntity
					.getTransportationRemark()==null){
				waybillInfoVo.setTransportationRemark("");
			}else{
				waybillInfoVo.setTransportationRemark(String.valueOf(waybillEntity.getTransportationRemark()));
			}
			// 货物包装
			waybillInfoVo.setGoodsPackage(waybillEntity.getGoodsPackage());
			// 纸
			waybillInfoVo.setPaper(waybillEntity.getPaperNum());
			// 木
			waybillInfoVo.setWood(waybillEntity.getWoodNum());
			waybillInfoVo.setOldWood(waybillEntity.getWoodNum());
			// 纤
			waybillInfoVo.setFibre(waybillEntity.getFibreNum());
			// 托
			waybillInfoVo
					.setSalver(waybillEntity.getSalverNum());
			// 膜
			waybillInfoVo.setMembrane(waybillEntity
					.getMembraneNum());
			// 其他
			waybillInfoVo.setOtherPackage(waybillEntity.getOtherPackage());

			// 保价声明价值
			if (waybillEntity.getInsuranceAmount() != null) {
				waybillInfoVo.setInsuranceAmount(waybillEntity
						.getInsuranceAmount());
			}
			if(waybillEntity.getInsuranceAmount().compareTo(BigDecimal.ZERO)==0){
				waybillInfoVo.setInsuranceAmount(BigDecimal.ZERO);
			}
			// 保价费率
			//将保险费率转换成千分率的格式
			BigDecimal permillage = new BigDecimal(WaybillConstants.PERMILLAGE);
			BigDecimal feeRate = waybillEntity.getInsuranceRate();
			feeRate = feeRate.multiply(permillage);
			waybillInfoVo.setInsuranceRate(feeRate);
			// 保价费
			if (waybillEntity.getInsuranceFee() != null) {
				waybillInfoVo.setInsuranceFee(waybillEntity.getInsuranceFee());
			}
			if(waybillEntity.getInsuranceAmount().compareTo(BigDecimal.ZERO)==0){
				waybillInfoVo.setInsuranceAmount(BigDecimal.ZERO);
			}
			// 代收货款
			if (waybillEntity.getCodAmount() != null) {
				waybillInfoVo.setCodAmount(waybillEntity.getCodAmount());
			}
			// 代收费率
			BigDecimal codRate = waybillEntity.getCodRate();
			codRate = codRate.multiply(permillage);
			waybillInfoVo.setCodRate(codRate);
			// 代收货款手续费
			if (waybillEntity.getCodFee() != null) {
				waybillInfoVo.setCodFee(waybillEntity.getCodFee());
			}
			
			DataDictionaryValueVo refundType = dataDictionaryValueEntityToVo(
					WaybillConstants.REFUND_TYPE,
					waybillEntity.getRefundType());
			/**
			 *   退款类型即日退和三日退可以更改为审核退，
			 *   但是审核退不能更改为即日退或三日退，
			 *   即日退和三日退之间也不能相互更改，
			 */
			if(refundType == null){
				setNullRefundType();
			}else if (WaybillConstants.REFUND_TYPE_THREE_DAY.equals(refundType.getValueCode())) {
				// 三日退
				setThreeDayRefundType();
			}else if (WaybillConstants.REFUND_TYPE_ONE_DAY.equals(refundType.getValueCode())) {
				//即日退
				setOneDayRefundType();
			}else if (WaybillConstants.REFUND_TYPE_VALUE.equals(refundType.getValueCode())) {
				//审核退
				setValueRefundType();
			}
			
			// 退款类型
			waybillInfoVo.setRefundType(refundType);
			// 返单类别
			waybillInfoVo.setReturnBillType(dataDictionaryValueEntityToVo(
					WaybillConstants.RETURN_BILL_TYPE,
					waybillEntity.getReturnBillType()));
			// 预付费保密
			waybillInfoVo.setSecretPrepaid(FossConstants.YES
					.equals(waybillEntity.getSecretPrepaid()));
			// 到付金额
			if (waybillEntity.getToPayAmount() != null) {
				waybillInfoVo.setToPayAmount(waybillEntity.getToPayAmount());
			}
			// 预付金额
			if (waybillEntity.getPrePayAmount() != null) {
				waybillInfoVo.setPrePayAmount(waybillEntity.getPrePayAmount());
			}
			// 送货费
			if (waybillEntity.getDeliveryGoodsFee() != null) {
				waybillInfoVo.setDeliveryGoodsFee(waybillEntity
						.getDeliveryGoodsFee());
			}
			//送货费（用于保存原始送货费）
			if(waybillEntity.getDeliveryGoodsFee() != null){
				waybillInfoVo.setCalculateDeliveryGoodsFee(waybillEntity.getDeliveryGoodsFee());
			}
			
			// 其他费用
			if (waybillEntity.getOtherFee() != null) {
				waybillInfoVo.setOtherFee(waybillEntity.getOtherFee());
			}
			// 包装手续费
			if (waybillEntity.getPackageFee() != null) {
				waybillInfoVo.setPackageFee(waybillEntity.getPackageFee());
			}
			// 优惠费用
			if (waybillEntity.getPromotionsFee() != null) {
				waybillInfoVo
						.setPromotionsFee(waybillEntity.getPromotionsFee());
			}
			
			//合伙人添加保价费、代收手续费 2016年1月16日 16:57:13 葛亮亮
			if(BZPartnersJudge.IS_PARTENER)	
			{
				//保价费
				if (waybillEntity.getInsuranceFee() != null) {
					waybillInfoVo.setSupportFee(waybillEntity.getInsuranceFee());
				}
				//代收手续费
				if (waybillEntity.getCodFee() != null) {
					waybillInfoVo.setCollectingFee(waybillEntity.getCodFee());
				}
			}
			
			// 运费计费类型
			waybillInfoVo.setBillingType(dataDictionaryValueEntityToVo(
					WaybillConstants.BILLING_WAY,
					waybillEntity.getBillingType()));
			// 运费计费费率
			waybillInfoVo.setUnitPrice(waybillEntity.getUnitPrice());
			// 公布价运费
			if (waybillEntity.getTransportFee() != null) {
				waybillInfoVo.setTransportFee(waybillEntity.getTransportFee());
			}// 增值费用
			if (waybillEntity.getValueAddFee() != null) {
				waybillInfoVo.setValueAddFee(waybillEntity.getValueAddFee());
			}
			// 开单付款方式
			waybillInfoVo.setPaidMethod(dataDictionaryValueEntityToVo(
					WaybillConstants.PAYMENT_MODE,
					waybillEntity.getPaidMethod()));
			// 到达类型
			waybillInfoVo.setArriveType(waybillEntity.getArriveType());
			// 运单状态
			waybillInfoVo.setActive(waybillEntity.getActive());
			// 禁行
			waybillInfoVo.setForbiddenLine(waybillEntity.getForbiddenLine());
			// 合票方式
			waybillInfoVo.setFreightMethod(dataDictionaryValueEntityToVo(
					WaybillConstants.MAKE_WAYBILL_WAY,
					waybillEntity.getFreightMethod()));
			// 航班类型
			waybillInfoVo.setFlightNumberType(dataDictionaryValueEntityToVo(
					WaybillConstants.AIR_FLIGHT_TYPE,
					waybillEntity.getFlightNumberType()));// 航班类型
			
			//兼容 原有的 航班类型 
			//下拉框模型
			DefaultComboBoxModel combFlightModeModel= waybillRFCUI.getWaybillInfoPanel().getTransferPanel().getTransportInfoPanel().getPredictFlightModel();
			for (int i = 0; i < combFlightModeModel.getSize(); i++) {
				DataDictionaryValueVo dv=(DataDictionaryValueVo)combFlightModeModel.getElementAt(i);
				if("NIGHT_FLIGHT".equals(dv.getValueCode())){
					combFlightModeModel.removeElementAt(i);
				}
			}
			if("NIGHT_FLIGHT".equals(waybillEntity.getFlightNumberType())){
				combFlightModeModel.addElement(waybillInfoVo.getFlightNumberType());
			}
			
			// 航班时间
			waybillInfoVo.setFlightShift(waybillEntity.getFlightShift());
			// 总费用
			if (waybillEntity.getTotalFee() != null) {
				waybillInfoVo.setTotalFee(waybillEntity.getTotalFee());
			}
			// 优惠编码
			waybillInfoVo.setPromotionsCode(waybillEntity.getPromotionsCode());
			// 运单处理状态
			waybillInfoVo.setWaybillstatus(waybillEntity.getPendingType());
			// 开单时间
			waybillInfoVo.setCreateTime(waybillEntity.getCreateTime());
			// 更新时间
			waybillInfoVo.setModifyTime(waybillEntity.getModifyTime());
			// 开单人
			waybillInfoVo.setCreateUserCode(waybillEntity.getCreateUserCode());
			// 更新人
			waybillInfoVo.setModifyUserCode(waybillEntity.getModifyUserCode());
			// 开单组织
			waybillInfoVo.setCreateOrgCode(waybillEntity.getCreateOrgCode());
			// 更新组织
			waybillInfoVo.setModifyOrgCode(waybillEntity.getModifyOrgCode());
			// 原运单ID
			waybillInfoVo.setRefId(waybillEntity.getRefId());
			// 原运单号
			waybillInfoVo.setRefCode(waybillEntity.getRefCode());
			// 币种
			waybillInfoVo.setCurrencyCode(waybillEntity.getCurrencyCode());
			// 是否整车运单
			waybillInfoVo.setIsWholeVehicle(FossConstants.YES
					.equals(waybillEntity.getIsWholeVehicle()));
			// 是否经过营业部
			waybillInfoVo.setIsPassDept(FossConstants.YES
					.equals(waybillEntity.getIsPassOwnDepartment()));
			// 整车开单报价
			if (waybillEntity.getWholeVehicleActualfee() != null) {
				waybillInfoVo.setWholeVehicleActualfee(waybillEntity
						.getWholeVehicleActualfee());
			}
			// 整车约车报价
			if (waybillEntity.getWholeVehicleAppfee() != null) {
				waybillInfoVo.setWholeVehicleAppfee(waybillEntity
						.getWholeVehicleAppfee());
			}
			// 返款帐户开户名称
			waybillInfoVo.setAccountName(waybillEntity.getAccountName());
			// 返款帐户开户账户
			waybillInfoVo.setAccountCode(waybillEntity.getAccountCode());
			// 返款帐户开户银行
			waybillInfoVo.setAccountBank(waybillEntity.getAccountBank());
			// 计费重量
			waybillInfoVo.setBillWeight(waybillEntity.getBillWeight());
			// 接货费
			if (waybillEntity.getPickupFee() != null) {
				waybillInfoVo.setPickupFee(waybillEntity.getPickupFee());
			}
			// 装卸费
			if (waybillEntity.getServiceFee() != null) {
				waybillInfoVo.setServiceFee(waybillEntity.getServiceFee());
			}
			// 预计到达时间
			waybillInfoVo.setPreArriveTime(waybillEntity.getPreArriveTime());
			// 运输类型
			waybillInfoVo.setTransportType(waybillEntity.getTransportType());
			// 打印次数
			waybillInfoVo.setPrintTimes(waybillEntity.getPrintTimes());
			// 新增时间
			waybillInfoVo.setAddTime(waybillEntity.getAddTime());
			//公里数
			waybillInfoVo.setKilometer(waybillEntity.getKilometer());
			// 是否经济自提件
			waybillInfoVo.setIsEconomyGoods(FossConstants.YES.equals(waybillEntity.getIsEconomyGoods()));
			// 经济自提件类型
			waybillInfoVo.setEconomyGoodsType(getEconomyGoodsTypeByCode(waybillEntity.getEconomyGoodsType(),waybillEntity.getBillTime()));
			// 初始化自提件类型控件
			initEconomyGoodsType(waybillInfoVo);
			//初始化市场营销活动
			initActiveInfo(waybillInfoVo);
			
			if (woodenRequirementsEntity != null) {
				// 代打木架部门
				waybillInfoVo.setPackageOrgCode(woodenRequirementsEntity
						.getPackageOrgCode());
				// ===========LianHe/增加非木包装费/2017年2月9日/start======= 
				//增加非木包装费
				waybillInfoVo.setNonWoodPackingAmount(woodenRequirementsEntity.getNonWoodPackingAmount());
				waybillInfoVo.setNonWoodPackingCharge(woodenRequirementsEntity.getNonWoodPackingAmount());
				// ===========LianHe/增加非木包装费/2017年2月9日/end=======
				// 打木架货物件数
				waybillInfoVo.setStandGoodsNum(woodenRequirementsEntity
						.getStandGoodsNum());
				// 代打木架要求
				waybillInfoVo.setStandRequirement(woodenRequirementsEntity
						.getStandRequirement());
				// 打木架货物尺寸
				waybillInfoVo.setStandGoodsSize(woodenRequirementsEntity
						.getStandGoodsSize());
				// 打木架货物体积
				waybillInfoVo.setStandGoodsVolume(woodenRequirementsEntity
						.getStandGoodsVolume());
				// 打木箱货物件数
				waybillInfoVo.setBoxGoodsNum(woodenRequirementsEntity
						.getBoxGoodsNum());
				// 代打木箱要求
				waybillInfoVo.setBoxRequirement(woodenRequirementsEntity
						.getBoxRequirement());
				// 打木箱货物尺寸
				waybillInfoVo.setBoxGoodsSize(woodenRequirementsEntity
						.getBoxGoodsSize());
				// 打木箱货物体积
				waybillInfoVo.setBoxGoodsVolume(woodenRequirementsEntity
						.getBoxGoodsVolume());
				// 获取代打木架费用
				getYokeCharge(waybillInfoVo);
				//zxy 20131118 ISSUE-4391 start 新增：设置木托属性
				waybillInfoVo.setSalverGoodsNum(woodenRequirementsEntity.getSalverGoodsNum());
				waybillInfoVo.setSalverRequirement(woodenRequirementsEntity.getSalverRequirement());
				waybillInfoVo.setSalverGoodsCharge(woodenRequirementsEntity.getSalverGoodsAmount());
				// 将导入时的木托费设置到pre字段，保证第一次修改木托信息时价格正确
				waybillInfoVo.setPreSalverGoodsCharge(woodenRequirementsEntity.getSalverGoodsAmount());
				//zxy 20131118 ISSUE-4391 end 新增：设置木托属性
				/**
				 * 将打包装原始运单的信息的14个字段传入waybillInfoVo中
				 * @author:218371-foss-zhaoyanjun
				 * @date:2014-12-7下午13:24
				 */
				waybillInfoVo.setPaperBoxOne(woodenRequirementsEntity.getPaperBoxOne());
				waybillInfoVo.setPaperBoxTwo(woodenRequirementsEntity.getPaperBoxTwo());
				waybillInfoVo.setPaperBoxThree(woodenRequirementsEntity.getPaperBoxThree());
				waybillInfoVo.setPaperBoxFour(woodenRequirementsEntity.getPaperBoxFour());
				waybillInfoVo.setFibelBagBlueOne(woodenRequirementsEntity.getFibelBagBlueOne());
				waybillInfoVo.setFibelBagBlueTwo(woodenRequirementsEntity.getFibelBagBlueTwo());
				waybillInfoVo.setFibelBagBlueThree(woodenRequirementsEntity.getFibelBagBlueThree());
				waybillInfoVo.setFibelBagBlueFour(woodenRequirementsEntity.getFibelBagBlueFour());
				waybillInfoVo.setFibelBagWhiteOne(woodenRequirementsEntity.getFibelBagWhiteOne());
				waybillInfoVo.setFibelBagWhiteTwo(woodenRequirementsEntity.getFibelBagWhiteTwo());
				waybillInfoVo.setFibelBagWhiteThree(woodenRequirementsEntity.getFibelBagWhiteThree());
				waybillInfoVo.setFibelBagWhiteFour(woodenRequirementsEntity.getFibelBagWhiteFour());
				waybillInfoVo.setFibelBagWhiteClothFive(woodenRequirementsEntity.getFibelBagWhiteClothFive());
				waybillInfoVo.setFibelBagWhiteClothSix(woodenRequirementsEntity.getFibelBagWhiteClothSix());
			}else{
				//打木架费用
				waybillInfoVo.setStandCharge(BigDecimal.ZERO);
				//打木箱费用
				waybillInfoVo.setBoxCharge(BigDecimal.ZERO);
				/**
				 * 将打包装四项费用设为0
				 * @author:218371-foss-zhaoyanjun
				 * @date:2014-12-7下午13:24
				 */
				waybillInfoVo.setPaperBoxTotlePrice(BigDecimal.ZERO);
				waybillInfoVo.setFibelBagTotlePrice(BigDecimal.ZERO);
				waybillInfoVo.setOtherTotle(BigDecimal.ZERO);
				waybillInfoVo.setPackingTotle(BigDecimal.ZERO);
			}
			
			
			// 查询走货路径
			OrgInfoDto dto = null;
			try {

				if(waybillInfoVo.getPickupCentralized()!=null&&waybillInfoVo.getPickupCentralized()){
					dto = rfcService.queryLodeDepartmentInfo(waybillInfoVo.getPickupCentralized(),waybillInfoVo.getCreateOrgCode(), waybillInfoVo.getCustomerPickupOrgCode().getCode(), waybillInfoVo.getProductCode().getCode());
				}else{
					dto = rfcService.queryLodeDepartmentInfo(waybillInfoVo.getPickupCentralized(),waybillInfoVo.getReceiveOrgCode(), waybillInfoVo.getCustomerPickupOrgCode().getCode(), waybillInfoVo.getProductCode().getCode());
				}
				waybillInfoVo.setOrgInfoDto(dto);
			} catch (BusinessException e) {
				LOG.error("WaybillValidateException", e);
			}
			
			//整车不允许修改木架
			if(waybillInfoVo.getIsWholeVehicle()!=null && waybillInfoVo.getIsWholeVehicle()){
				//不能打木架
				waybillInfoVo.setDoPacking(FossConstants.NO);
			}else if (waybillInfoVo.getStockStatus() != null
					&& waybillInfoVo.getCustomerPickupOrgCode() != null
					&& waybillInfoVo.getProductCode() != null) {
				if (dto == null || dto.getFreightRoute() == null) {
					//不能打木架
					waybillInfoVo.setDoPacking(FossConstants.NO);
//					waybillInfoVo.setGoodsTypeIsAB(false);//是否AB货
				} else {
					if(waybillInfoVo.getPackageOrgCode() == null){
						waybillInfoVo.setPackageOrgCode(dto.getFreightRoute().getPackingOrganizationCode());// 代打木架部门编码
						waybillInfoVo.setPackingOrganizationName(dto.getFreightRoute().getPackingOrganizationName());// 代打木架部门名称
					}else{
						waybillInfoVo.setPackingOrganizationName(rfcService.queryDeptNameByCode(waybillInfoVo.getPackageOrgCode()));
					}
					waybillInfoVo.setDoPacking(dto.getFreightRoute().getDoPacking());// 是否可以打木架
					waybillInfoVo.setLastOutLoadOrgCode(dto.getLastOutLoadOrgCode());//最终配置外场
//					waybillInfoVo.setGoodsTypeIsAB(dto.getGoodsTypeIsAB());//是否AB货
				}
			}
			// 附加增值服务费
			List<WaybillOtherChargeDto> chargeDtlEntities = rfcImportDto
					.getOtherChargeDtos();
			List<OtherChargeVo> otherChargeVos = new ArrayList<OtherChargeVo>();
			if (chargeDtlEntities != null) {
				OtherChargeVo vo = null;
				for (WaybillOtherChargeDto entity : chargeDtlEntities) {
					vo = new OtherChargeVo();
					if(StringUtil.isEmpty(entity.getAmount()) || "0".equals(entity.getAmount())){
						continue;
					}
					vo.setCode(entity.getCode());
					vo.setId(entity.getId());
					vo.setMoney(entity.getAmount());
					vo.setOldMoney(entity.getAmount());
					vo.setChargeName(entity.getChargeName());
					vo.setDescrition(entity.getDescrition());
					vo.setIsDelete(!FossConstants.NO.equals(entity
							.getIsDelete()));
					//================合伙人时，如果是异常操作费，设置为不可更改========================
					if (BZPartnersJudge.IS_PARTENER && PriceEntityConstants.PRICING_CODE_ZZ.equals(entity.getCode())) {
						vo.setIsUpdate(Boolean.FALSE);
					}else{
						vo.setIsUpdate(!FossConstants.NO.equals(entity
								.getIsUpdate()));
					}
					//====================================================================
					vo.setLowerLimit(entity.getLowerLimit());
					vo.setType(entity.getType());
					vo.setUpperLimit(entity.getUpperLimit());
					/**
					 * 是否初始化值，为了判断，多次转运和多次返货时，需要对转货费和转运费进行判断，
					 * 是否是导入时的值，如果是，需要重新在界面表格里面重新加入一个值,如果不是，重新改值
					 */
					vo.setIsInit(Boolean.TRUE);
					//内部更改修改走货路径，触发中转费的修改，便于定位修改了哪条记录
					vo.setIsEdit(Boolean.FALSE);
					otherChargeVos.add(vo);
				}
			}
			//其他费用明细
			waybillInfoVo.setOtherChargeVos(otherChargeVos);
			//变更前流水号
			waybillInfoVo.setLabeledGoodEntities(rfcImportDto
					.getLabeledGoodEntities());
			
			//更改单修改件数和打木架数量修改详细信息冗余保存对象
			waybillInfoVo.setLabeledGoodChangeHistoryDtoList(rfcImportDto
					.getLabeledGoodChangeHistoryDtoList());
			
			//需要打木架的流水号
			waybillInfoVo
					.setSelectedLabeledGoodEntities(getSelectedLabeledGoodEntities(waybillInfoVo));
			//转运起始网点
			waybillInfoVo.setTfrStartOrgCode(getTfrStartOrgCode(waybillInfoVo));
			//返货起始网点
			waybillInfoVo.setRtnStartOrgCode(getRtnStartOrgCode(waybillInfoVo));
			//是否月结
			waybillInfoVo.setChargeMode(isChargeMode(waybillInfoVo.getDeliveryCustomerCode()));		
			CusBargainEntity  cusBargainEntity=getCusBargainEntity(waybillInfoVo.getDeliveryCustomerCode());
			if(cusBargainEntity!=null){
			waybillInfoVo.setPreferentialType(cusBargainEntity.getPreferentialType());//获取优惠类型
			}
			
			
			
			
			//设置客户其他属性
			setCustomerQueryConditionValue(waybillInfoVo);

			// 长短途
			EffectiveDto effectiveDto = null;
			if(WaybillConstants.HIGHWAYS_REFERRALS.equals(waybillInfoVo.getProductCode().getCode())){
				effectiveDto = rfcService.searchPreSelfPickupTime(waybillInfoVo.getReceiveOrgCode(),
						waybillInfoVo.getCustomerPickupOrgCode().getCode(), waybillInfoVo.getProductCode().getCode(), waybillInfoVo.getPreDepartureTime(), waybillInfoVo.getBillTime());
			}else{
				effectiveDto = rfcService.searchPreSelfPickupTime(waybillInfoVo.getReceiveOrgCode(),
						waybillInfoVo.getLastLoadOrgCode(), waybillInfoVo.getProductCode().getCode(), waybillInfoVo.getPreDepartureTime(), waybillInfoVo.getBillTime());
			}
			if (effectiveDto != null) {
				waybillInfoVo.setLongOrShort(effectiveDto.getLongOrShort());
			}else{
				//waybillInfoVo.setLongOrShort(PricingConstants.LONG_OR_SHORT_L);
			}
							

			//整车
			if(waybillInfoVo.getIsWholeVehicle()) {
				
				
				UserEntity user = (UserEntity) SessionContext.getCurrentUser();
				//调用接口查询整车价格参数波动范围
				CarloadPricePlanDto carloadDto = baseDataService.queryByConfCode(waybillEntity.getBillTime(),waybillInfoVo.getInvoice(),user.getEmployee().getDepartment().getCode());
				//调用接口查询整车价格波动范围 
//				ConfigurationParamsEntity param = baseDataService.queryByConfCode(
//						WaybillConstants.WHOLEVEHICLE_FEE_RANGE_UP, 
//						user.getEmployee().getDepartment().getCode());
//				
//				if(param!=null){
//					waybillInfoVo.setWholeVehicleActualfeeFlowRangeUp(
//						new BigDecimal(param.getConfValue()));
//				}
//				
//				
//				//调用接口查询整车价格波动范围 
//				ConfigurationParamsEntity param2 = baseDataService.queryByConfCode(
//						WaybillConstants.WHOLEVEHICLE_FEE_RANGE_LOW, 
//						user.getEmployee().getDepartment().getCode());
//				
//				if(param2!=null){
//					waybillInfoVo.setWholeVehicleActualfeeFlowRangeLow(
//						new BigDecimal(param2.getConfValue()));
//				}
				if(null!=carloadDto){
					waybillInfoVo.setWholeVehicleActualfeeFlowRangeUp(carloadDto.getFloatUp());
					waybillInfoVo.setWholeVehicleActualfeeFlowRangeLow(carloadDto.getFloatDown());
					/**
					 *DMANA-3563 整车开单判断是否盈利  新增参数
					 */
					//重量参数
					waybillInfoVo.setWholeVehicleWeightParameter(carloadDto.getWeightParameter());
					//包装费参数
					waybillInfoVo.setWholeVehiclePackageFeeParameter(carloadDto.getPackageFeeParameter());
					//其他成本参数
					waybillInfoVo.setWholeVehicleOtherCostParameter(carloadDto.getOtherCostParameter());
					//人力成本参数
					waybillInfoVo.setWholeVehicleHumanCostParameter(carloadDto.getHumanCostParameter());
					//车价参数
					waybillInfoVo.setWholeVehicleCarCostParameter(carloadDto.getCarCostParameter());
				}else{
					throw new WaybillValidateException("没有查询到相应的整车价格参数波动方案");
				}
			}
			
			/*if(waybillEntity
					.getDeliveryCustomerId()!=null){
				CustomerQueryConditionDto condition = new CustomerQueryConditionDto();
				condition.setCustId(waybillEntity
					.getDeliveryCustomerId());
				List<CustomerQueryConditionDto>  dtoList = customerService.queryCustomerByCondition(condition);
				if(dtoList ==null || dtoList.size()==0){
					waybillInfoVo.setChargeMode(false);// 是否月结
				}else{
					CustomerQueryConditionDto dtoCust = dtoList.get(0);
					
					waybillInfoVo.setChargeMode(DictionaryValueConstants.CLEARING_TYPE_MONTH.equals(dtoCust.getChargeType()) 
						? Boolean.valueOf(true) : Boolean.valueOf(false));
				}
			}else{

				waybillInfoVo.setChargeMode(false);// 是否月结
			}*/
			
			//waybillInfoVo.setCalculateDeliveryGoodsFee(BigDecimal.ZERO);//计算后的送货费
			

			//根据部门是否开装卸费设置编辑状态
			if(departPropertyServiceFee(waybillInfoVo))
			{
				//设置该部门不允许修改装卸费
				waybillInfoVo.setDepartServiceFeeEnable(true);
			}else{
				waybillInfoVo.setDepartServiceFeeEnable(false);
			}
			//清空调整费用
			waybillInfoVo.setAdjustFee(BigDecimal.ZERO);
			
			/**
			 * Dmana-10888备份客户编码与发票标记
			 * @author:218371-foss-zhaoyanjun
			 * @date:2015-03-24下午13:39
			 */
			waybillInfoVo.setBackupDeliveryCustomerCode(waybillInfoVo.getDeliveryCustomerCode());
			waybillInfoVo.setBackupInvoice(waybillInfoVo.getInvoice());
			//事后阶梯折装卸费不可编辑
			boolean flag = iSLtDiscountBackInfo(waybillInfoVo);
			if(!flag) {			
			waybillRFCUI.incrementPanel.getTxtServiceCharge().setEnabled(false);
			//给提示装卸费不可编辑
			waybillInfoVo.setServiceFee(BigDecimal.ZERO);
			waybillInfoVo.setServiceFeeCanvas("0");
		   }
		} catch (IllegalAccessException e) {
			LOG.error("exception",e);
		} catch (InvocationTargetException e) {
			LOG.error("exception",e);
		} catch (NoSuchMethodException e) {
			LOG.error("exception",e);
		}
		return waybillInfoVo;
	}
	
	/**
	 * 初始化自提件类型控件
	 */
	private void initEconomyGoodsType(WaybillInfoVo waybillInfoVo){
		List<MinFeePlanEntity> list = WaybillRfcServiceFactory.getWaybillRfcService().getMinFeePlanEntityByDate(waybillInfoVo.getBillTime());
		DefaultComboBoxModel economyGoodsTypeModel = waybillRFCUI.getWaybillInfoPanel().getBasicPanel().getEconomyGoodsTypeModel();
		if(economyGoodsTypeModel!=null){
			economyGoodsTypeModel.removeAllElements();
		}else{
			economyGoodsTypeModel=new DefaultComboBoxModel();
		}		
		for (MinFeePlanEntity entity : list) {
			if(entity!=null){
				DataDictionaryValueVo vo=new DataDictionaryValueVo();
				vo.setId(entity.getId());
				vo.setValueCode(entity.getChannelCode());
				vo.setValueName(entity.getPlanName());
				economyGoodsTypeModel.addElement(vo);
			}			
		}
	}
	/**
	 * 初始化市场营销活动信息
	 * @创建时间 2014-4-22 下午8:52:22   
	 * @创建人： WangQianJin
	 */
	private void initActiveInfo(WaybillInfoVo waybillInfoVo){
		//获取当前登陆部门code
		UserEntity user = (UserEntity)SessionContext.getCurrentUser();
		String currentOrgCode = user.getEmployee().getDepartment().getCode();
		//获取运单营销活动
		DataDictionaryValueVo activeInfo=new DataDictionaryValueVo();
		WaybillDisDtlEntity entity=rfcService.queryActiveInfoByNoAndType(waybillInfoVo.getWaybillNo());
		if(entity!=null){
			activeInfo.setValueCode(entity.getActiveCode());
			activeInfo.setValueName(entity.getActiveName());			
		}else{			
			activeInfo.setValueName("");
		}
		//设置市场营销活动
		waybillInfoVo.setActiveInfo(activeInfo);
		
		DefaultComboBoxModel activeInfoModel = waybillRFCUI.getWaybillInfoPanel().getIncrementPanel().getActiveInfoModel();
		if(activeInfoModel!=null){
			activeInfoModel.removeAllElements();
		}else{
			activeInfoModel=new DefaultComboBoxModel();
		}
		//添加空活动
		DataDictionaryValueVo nullVo = new DataDictionaryValueVo();
		nullVo.setValueName("");
		activeInfoModel.addElement(nullVo);		
		if(activeInfo.getValueCode()!=null){
			activeInfoModel.addElement(activeInfo);
		}
		//获取开单时的营销活动列表
		CrmActiveParamVo param=new CrmActiveParamVo();
		param.setCurrentDate(waybillInfoVo.getBillTime());
		param.setActivityCategory(DictionaryValueConstants.BUSINESS_LTT);
		param.setActive(FossConstants.ACTIVE);
		param.setCurrentOrgCode(currentOrgCode);
		CrmActiveInfoDto crmDto=rfcService.getActiveInfoList(param);
		if(crmDto!=null && crmDto.getActiveList()!=null && crmDto.getActiveList().size()>0){			
			List<MarkActivitiesQueryConditionDto> activeList=crmDto.getActiveList();	
			for (MarkActivitiesQueryConditionDto active : activeList) {
				//开单时选择的活动已添加，过滤掉已添加的活动
				if(active!=null && active.getCode()!=null && !active.getCode().equals(activeInfo.getValueCode())){
					DataDictionaryValueVo vo=new DataDictionaryValueVo();					
					vo.setValueCode(active.getCode());
					vo.setValueName(active.getName());
					activeInfoModel.addElement(vo);					
				}			
			}
			//选中营销活动
			activeInfoModel.setSelectedItem(waybillInfoVo.getActiveInfo());
		}else{
			//添加开单选择的活动
			if(activeInfo.getValueCode()!=null){
				//activeInfoModel.addElement(activeInfo);
				activeInfoModel.setSelectedItem(waybillInfoVo.getActiveInfo());
			}
		}	
		
	}
			

	/**
	 * 设置客户其他属性
	 * @param waybillInfoVo
	 */
	private void setCustomerQueryConditionValue(WaybillInfoVo waybillInfoVo) {
		String deliveryCustomerCode = waybillInfoVo.getDeliveryCustomerCode();
		
		if(StringUtil.isNotEmpty(deliveryCustomerCode)){
			// 查询客户信息
			CusBargainEntity  cusBargainEntity = rfcService.queryCusBargainByCustCode(deliveryCustomerCode);
		
			if(cusBargainEntity != null){
				// 合同编号
				waybillInfoVo.setAuditNo(cusBargainEntity.getBargainCode());
			}
		}
		
	}

	/**
	 * 
	 * 退款类型为三日退
	 * @author 102246-foss-shaohongliang
	 * @date 2013-3-26 下午4:46:54
	 */
	private void setThreeDayRefundType() {
		//查询退款类型
		List<DataDictionaryValueEntity> list = rfcService.queryRefundType();
		//下拉框模型
		DefaultComboBoxModel combRefundTypeModel = waybillRFCUI.getWaybillInfoPanel().getIncrementPanel().getRefundTypeModel();
		combRefundTypeModel.removeAllElements();
		combRefundTypeModel.addElement(null);
		for (DataDictionaryValueEntity dataDictionary : list) {
			//即日退和三日退可以更改为审核退，即日退和三日退之间也不能相互更改
			if(WaybillConstants.REFUND_TYPE_ONE_DAY.equals(dataDictionary.getValueCode())){
				continue;
			}
			//Entity转换为VO
			DataDictionaryValueVo vo = new DataDictionaryValueVo();
			ValueCopy.valueCopy(dataDictionary, vo);
			//填充至 数据模型
			combRefundTypeModel.addElement(vo);
		}
	}
	
	/**
	 * 
	 * 退款类型为即日退
	 * @author 102246-foss-shaohongliang
	 * @date 2013-3-26 下午4:46:54
	 */
	private void setOneDayRefundType() {
		//查询退款类型
		List<DataDictionaryValueEntity> list = rfcService.queryRefundType();
		//下拉框模型
		DefaultComboBoxModel combRefundTypeModel = waybillRFCUI.getWaybillInfoPanel().getIncrementPanel().getRefundTypeModel();
		combRefundTypeModel.removeAllElements();
		combRefundTypeModel.addElement(null);
		for (DataDictionaryValueEntity dataDictionary : list) {
			//即日退和三日退可以更改为审核退，即日退和三日退之间也不能相互更改
			if(WaybillConstants.REFUND_TYPE_THREE_DAY.equals(dataDictionary.getValueCode())){
				continue;
			}
			//Entity转换为VO
			DataDictionaryValueVo vo = new DataDictionaryValueVo();
			ValueCopy.valueCopy(dataDictionary, vo);
			//填充至 数据模型
			combRefundTypeModel.addElement(vo);
		}
	}
	
	/**
	 * 
	 * 退款类型为审核退
	 * @author 102246-foss-shaohongliang
	 * @date 2013-3-26 下午4:46:54
	 */
	private void setValueRefundType() {
		//查询退款类型
		List<DataDictionaryValueEntity> list = rfcService.queryRefundType();
		//下拉框模型
		DefaultComboBoxModel combRefundTypeModel = waybillRFCUI.getWaybillInfoPanel().getIncrementPanel().getRefundTypeModel();
		combRefundTypeModel.removeAllElements();
		combRefundTypeModel.addElement(null);
		for (DataDictionaryValueEntity dataDictionary : list) {
			//审核退不能更改为即日退或三日退
			if(WaybillConstants.REFUND_TYPE_THREE_DAY.equals(dataDictionary.getValueCode())
					|| WaybillConstants.REFUND_TYPE_ONE_DAY.equals(dataDictionary.getValueCode())){
				continue;
			}
			//Entity转换为VO
			DataDictionaryValueVo vo = new DataDictionaryValueVo();
			ValueCopy.valueCopy(dataDictionary, vo);
			//填充至 数据模型
			combRefundTypeModel.addElement(vo);
		}
	}
	
	/**
	 * 
	 * 退款类型为空
	 * @author 102246-foss-shaohongliang
	 * @date 2013-3-26 下午4:46:54
	 */
	private void setNullRefundType() {
		//查询退款类型
		List<DataDictionaryValueEntity> list = rfcService.queryRefundType();
		//下拉框模型
		DefaultComboBoxModel combRefundTypeModel = waybillRFCUI.getWaybillInfoPanel().getIncrementPanel().getRefundTypeModel();
		combRefundTypeModel.removeAllElements();
		combRefundTypeModel.addElement(null);
		for (DataDictionaryValueEntity dataDictionary : list) {
			//Entity转换为VO
			DataDictionaryValueVo vo = new DataDictionaryValueVo();
			ValueCopy.valueCopy(dataDictionary, vo);
			//填充至 数据模型
			combRefundTypeModel.addElement(vo);
		}
	}

	/**
	 * 
	 * 设置空运类型
	 * @param waybillInfoVo
	 * @param waybillEntity
	 */
	private void setAirGoodType(WaybillInfoVo waybillInfoVo,
			WaybillEntity waybillEntity) {
		List<GoodsTypeEntity>  list = rfcService.findGoodsTypeByCondiction();
		for (GoodsTypeEntity goodsType : list) {
			DataDictionaryValueVo vo = new DataDictionaryValueVo();
			ValueCopy.valueCopy(goodsType, vo);
			
			if(vo.getValueCode().equals(waybillEntity.getGoodsTypeCode())){
				waybillInfoVo.setAirGoodsType(vo);
			}
		}
	}
	
	/**
	 * 否可以开装卸费的依据取决于部门的业务属性（即部门属性基础资料中增加是否可开装卸费的字段）
	 * @param bean
	 * @return
	 */
	private boolean departPropertyServiceFee(WaybillInfoVo bean) {
	
		// 收货部门
		String orgCode = bean.getReceiveOrgCode();
		// 开单时间 -- update by taodongguo(354805) -- 2016-12-6 16:43:14
		Date billTime = bean.getBillTime() == null ? bean.getCreateTime() : bean.getBillTime();
		if(null == billTime){
			billTime = new Date();
		}
		
		// org code is not null;
		if(StringUtils.isNotEmpty(orgCode)){
			// 根据编码查询
			String canPayServiceFee = rfcService.queryCanPayServiceFeeByCodeAndTime(orgCode, billTime);
			if(StringUtil.isNotEmpty(canPayServiceFee) && FossConstants.YES.equals(canPayServiceFee)){
				return true;
			}else{
				return false;
			}
		}
		return true;
	}

	/**
	 * 
	 * 根据客户编码判断是否月结客户
	 * @author 102246-foss-shaohongliang
	 * @date 2013-1-5 下午5:05:13
	 */
	private boolean isChargeMode(String deliveryCustomerCode) {
		if(deliveryCustomerCode == null){
			return false;
		}
		//根据客户编码查询客户
		CustomerDto customerDto = rfcService.queryCustInfoByCode(deliveryCustomerCode);
		if(customerDto == null){
			return false;
		}
		//客户合同
		List<CusBargainEntity> cusBargainEntities = customerDto.getBargainList();
		
		if(cusBargainEntities!=null){
			for(CusBargainEntity cusBargainEntity : cusBargainEntities){
				if(DictionaryValueConstants.CLEARING_TYPE_MONTH.equals(cusBargainEntity.getChargeType())){
					return true;
				}
			}
		}
			
		return false;
	}
	
	
	/**
	 * 根据客户编码查询获得客户类型
	 * @author 026123-foss-lifengteng
	 * @date 2013-5-21 下午3:22:31
	 */
	public CusBargainEntity getCusBargainEntity(String custCode) {
		if (StringUtils.isNotEmpty(custCode)) {
			// 获得合同信息
			CusBargainEntity cusBargain = rfcService
					.queryCusBargainByCustCode(custCode);
			return cusBargain;
		} else {
			return null;
		}
	}
	
	

	/**
	 * 
	 * 获取返货起始网点
	 * @author 102246-foss-shaohongliang
	 * @date 2012-12-25 上午10:35:36
	 */
	private String getRtnStartOrgCode(WaybillInfoVo bean) {
		//货物状态
		DataDictionaryValueVo goodsStatus = bean.getGoodsStatus();
		if(goodsStatus == null){
			return null;
		}
		//返货起始网点默认为原目的站
		String rtnStartOrgCode = bean.getCustomerPickupOrgCode() == null ? null: bean.getCustomerPickupOrgCode().getCode();
		rtnStartOrgCode = rfcService.queryStationDeliverOrgCode(rtnStartOrgCode);

		String inventory = goodsStatus.getValueCode();
		//未出第一外场返货从第一外场开始
		if (WaybillRfcConstants.RECEIVE_STOCK.equals(inventory)
				|| WaybillRfcConstants.RECEIVE_STOCK_OUT.equals(inventory)
				|| (WaybillRfcConstants.TRANSFER_STOCK.equals(inventory) && 
				bean.getLoadOrgCode().equals(bean.getStockStatus().getCurrentStockOrgCode()))) {
			rtnStartOrgCode = rfcService.queryStationDeliverOrgCode(bean.getLoadOrgCode());
		}
		
		// 原运输性质
		String procuctCode = bean.getProductCode().getCode();
		
		//已出最终配载且是空运、偏线运输性质
		if (ProductEntityConstants.PRICING_PRODUCT_AIR_FREIGHT.equals(procuctCode) 
				|| ProductEntityConstants.PRICING_PRODUCT_PARTIAL_LINE.equals(procuctCode)) {
			String dept=null;
			if(ProductEntityConstants.PRICING_PRODUCT_AIR_FREIGHT.equals(procuctCode)){
				dept =rfcService.queryTransferCenterByAirDispatchCode(bean.getLastLoadOrgCode());
			}
			if(dept==null){
				rtnStartOrgCode = rfcService.queryStationDeliverOrgCode(bean.getLastLoadOrgCode());
			}else{
				rtnStartOrgCode = rfcService.queryStationDeliverOrgCode(dept);
			}
			if (WaybillRfcConstants.DELIVERY_STOCK_OUT.equals(inventory)) {
				//若货物已出原最终配载部门库存，转运运输性质只能为偏线或空运
				bean.setRtnNeedFilter(true);
			}
		} 
//		rtnStartOrgCode = bean.getCreateOrgCode();
		
		return rtnStartOrgCode;
	}

	/**
	 * 
	 * 获取转运起始网点
	 * @author 102246-foss-shaohongliang
	 * @date 2012-12-25 上午10:35:59
	 */
	private String getTfrStartOrgCode(WaybillInfoVo bean) {
		//货物状态
		DataDictionaryValueVo goodsStatus = bean.getGoodsStatus();
		if(goodsStatus == null){
			return null;
		}
		
	String 	tfrStartOrgCode = rfcService.queryStationDeliverOrgCode(bean.getLastLoadOrgCode());
		
		String inventory = goodsStatus.getValueCode();
		// 原运输性质
		String procuctCode = bean.getProductCode().getCode();

		//已出最终配载且是空运、偏线运输性质
		if (ProductEntityConstants.PRICING_PRODUCT_AIR_FREIGHT.equals(procuctCode) 
				|| ProductEntityConstants.PRICING_PRODUCT_PARTIAL_LINE.equals(procuctCode)) {
			String dept=null;
			if(ProductEntityConstants.PRICING_PRODUCT_AIR_FREIGHT.equals(procuctCode)){
				dept =rfcService.queryTransferCenterByAirDispatchCode(bean.getLastLoadOrgCode());
			}
			if(dept!=null){
				tfrStartOrgCode = rfcService.queryStationDeliverOrgCode(dept);
			}else{
				tfrStartOrgCode = rfcService.queryStationDeliverOrgCode(bean.getLastLoadOrgCode());
			}
			if (WaybillRfcConstants.DELIVERY_STOCK_OUT.equals(inventory)) {
				//若货物已出原最终配载部门库存，转运运输性质只能为偏线或空运
				bean.setTfrNeedFilter(true);
			} 
		}
//		tfrStartOrgCode = bean.getCreateOrgCode();
		return tfrStartOrgCode;
	}

	/**
	 * 
	 * 获取选中的流水号
	 * 
	 * @author 102246-foss-shaohongliang
	 * @date 2012-12-19 下午2:00:09
	 */
	private List<LabeledGoodChangeHistoryDto> getSelectedLabeledGoodEntities(
			WaybillInfoVo bean) {
		//代打包装总数量
		int count = 0;
		if (bean.getStandGoodsNum() != null) {
			//打木架件数
			count += bean.getStandGoodsNum();
		}
		if (bean.getBoxGoodsNum() != null) {
			//打木箱件数
			count += bean.getBoxGoodsNum();
		}
		List<LabeledGoodChangeHistoryDto> entitys = 
				bean.getLabeledGoodChangeHistoryDtoList();
		//如果打木架件数与木箱件数之和大于
		if(count > entitys.size()){
			count = entitys.size();
		}
		//依据流水号从小到大挑选代打包装流水号
		for (int i = 0; i < entitys.size(); i++) {
			
			
			LabeledGoodChangeHistoryDto dto  = entitys.get(i);
			
			
			if(Integer.valueOf(1).toString().equals(dto.getChangeTimes())){
				if(i<count){
					dto.setChangeType(LabeledGoodChangeHistoryConstants.CHANGE_TYPE_WOODEN_ADD);
				}
			}else{
				
				//上一次的更改结果
				if(LabeledGoodChangeHistoryConstants.CHANGE_TYPE_WOODEN_ADD.equals(dto.getChangeType())
						||LabeledGoodChangeHistoryConstants.CHANGE_TYPE_WOODEN_ADD_NEW.equals(dto.getChangeType() )){
					dto.setChangeType(LabeledGoodChangeHistoryConstants.CHANGE_TYPE_WOODEN_ADD);
					
				}
			}
			
			
		}
		return entitys;
	}

	/**
	 * 
	 * 国家省市区
	 * 
	 * @author 102246-foss-shaohongliang
	 * @updateAuthor 354805-foss-taodongguo
	 * @date 2012-12-4 上午8:54:29
	 */
	private AddressFieldDto getProvCityCounty(String nationCode, String provCode, String cityCode,
			String distCode) {
		AddressFieldDto addressFieldDto = new AddressFieldDto();
		if(StringUtil.isNotEmpty(nationCode)){
			//填充国家名称
			addressFieldDto.setNationId(nationCode);
			String nation = rfcService.queryNationByCode(nationCode);
			if (StringUtil.isNotEmpty(nation)) {
				addressFieldDto.setNationName(nation);
			}
			
		}
		if (StringUtil.isNotEmpty(provCode)) {
			//填充省份名称
			addressFieldDto.setProvinceId(provCode);
			String province = rfcService.queryProvinceByCode(provCode);
			if (StringUtil.isNotEmpty(province)) {
				addressFieldDto.setProvinceName(province);
			}
			//根据省份填充国家
			if(StringUtil.isEmpty(nationCode)){
				AddressFieldDto dto = rfcService.queryNationByProvinceCode(provCode);
				addressFieldDto.setNationId(dto.getNationId());
				addressFieldDto.setNationName(dto.getNationName());
			}
		}
		if (StringUtil.isNotEmpty(cityCode)) {
			//填充城市名称
			addressFieldDto.setCityId(cityCode);
			String city = rfcService.queryCityByCode(cityCode);
			if (StringUtil.isNotEmpty(city)) {
				addressFieldDto.setCityName(city);
			}
		}
		if (StringUtil.isNotEmpty(distCode)) {
			//填充区域名称
			addressFieldDto.setCountyId(distCode);
			String county = rfcService.queryCountyByCode(distCode);
			if (StringUtil.isNotEmpty(county)) {
				addressFieldDto.setCountyName(county);
			}
		}
		return addressFieldDto;
	}
	
	/**
	 * 
	 * 省市区文本
	 * @author 102246-foss-shaohongliang
	 * @date 2012-12-23 上午10:19:50
	 */
	private String getAddressText(AddressFieldDto addressFieldDto){
		if(addressFieldDto == null){
			return "";
		}
		StringBuffer sb = new StringBuffer();
		if(StringUtil.isNotEmpty(addressFieldDto.getNationName())){
			if(!WaybillConstants.CHINA.equals(addressFieldDto.getNationName())){
				sb.append(addressFieldDto.getNationName());
				sb.append("-");
			}
		}
		if(StringUtil.isNotEmpty(addressFieldDto.getProvinceName())){
			sb.append(addressFieldDto.getProvinceName());
			sb.append("-");
		}
		if(StringUtil.isNotEmpty(addressFieldDto.getCityName())){
			sb.append(addressFieldDto.getCityName());
			sb.append("-");
		}
		if(StringUtil.isNotEmpty(addressFieldDto.getCountyName())){
			sb.append(addressFieldDto.getCountyName());
			sb.append("-");
		}
		if(sb.length()>0){
			return sb.substring(0, sb.length() - 1);
		}else{
			return sb.toString();
		}
	}

	/**
	 * 数据字典Entity转换VO
	 * 
	 * @author 102246-foss-shaohongliang
	 * @date 2012-11-6 上午11:22:15
	 */
	private DataDictionaryValueVo dataDictionaryValueEntityToVo(
			String termsCode, String valueCode) throws IllegalAccessException,
			InvocationTargetException, NoSuchMethodException {
		if (StringUtil.isNotEmpty(valueCode)) {
			DataDictionaryValueEntity entity = rfcService
					.queryDataDictoryValueEntity(termsCode, valueCode);
			if (entity == null){
				return null;
			}
			DataDictionaryValueVo vo = new DataDictionaryValueVo();
			PropertyUtils.copyProperties(vo, entity);
			return vo;
		} else {
			return null;
		}
	}

	/**
	 * 数据字典Entity转换VO
	 * 
	 * @author 102246-foss-shaohongliang
	 * @date 2012-11-6 上午11:22:15
	 */
	private ProductEntityVo getProductTypeByCode(String productCode,
			Date billDate) throws IllegalAccessException,
			InvocationTargetException, NoSuchMethodException {
		if (StringUtil.isNotEmpty(productCode)) {
			ProductEntity entity = rfcService.queryTransTypeByCode(productCode,
					billDate);
			if (entity == null){
				return null;
			}
			ProductEntityVo vo = new ProductEntityVo();
			PropertyUtils.copyProperties(vo, entity);
			return vo;
		} else {
			return null;
		}
	}
	
	/**
	 * 根据渠道CODE获取渠道类型
	 * @param channelCode
	 * @return
	 * @throws IllegalAccessException
	 * @throws InvocationTargetException
	 * @throws NoSuchMethodException
	 */
	private DataDictionaryValueVo getEconomyGoodsTypeByCode(String channelCode,Date billDate) throws IllegalAccessException,
			InvocationTargetException, NoSuchMethodException {
		DataDictionaryValueVo vo = null;
		if (StringUtil.isNotEmpty(channelCode)) {			
			List<MinFeePlanEntity> minFeeList=rfcService.getMinFeePlanEntityByDate(billDate);
			if(minFeeList!=null && minFeeList.size()>0){
				for(MinFeePlanEntity entity:minFeeList){
					if (entity!=null && channelCode!=null && channelCode.equals(entity.getChannelCode())){
						vo = new DataDictionaryValueVo();
						vo.setId(entity.getId());
						vo.setValueCode(entity.getChannelCode());
						vo.setValueName(entity.getPlanName());
						break;
					}
				}
			}
		}
		return vo;
	}
	
	/**
	 * 
	 * 获取代打木架费用
	 * 
	 * @author 025000-FOSS-helong
	 * @date 2012-11-29 下午05:21:48
	 */
	private void getYokeCharge(WaybillInfoVo bean) {
		// 获取木架费用
		getStandCharge(bean);
		// 获取木箱费用
		getBoxCharge(bean);

		BigDecimal calculatedPackageFee = BigDecimal.ZERO;
		if(bean.getStandCharge()!=null){
			calculatedPackageFee = calculatedPackageFee.add(bean.getStandCharge());
		}
		if(bean.getBoxCharge()!=null){
			calculatedPackageFee = calculatedPackageFee.add(bean.getBoxCharge());
		}
		// 计算值
		bean.setCalculatedPackageFee(calculatedPackageFee);
	}

	/**
	 * 
	 * 打木架费用
	 * 
	 * @author 025000-FOSS-helong
	 * @date 2012-11-30 下午03:29:21
	 */
	private void getStandCharge(WaybillInfoVo bean) {
		ValueAddDto dto = new ValueAddDto();

		if (bean.getStandGoodsNum()!=null && bean.getStandGoodsNum() > 0) {
			// 打木架
			List<ValueAddDto> frameList = rfcService
					.queryValueAddPriceList(getQueryYokeParam(bean,
							DictionaryValueConstants.PACKAGE_TYPE__FRAME,
							bean.getStandGoodsVolume()));

			if (frameList != null) {
				if (!frameList.isEmpty()) {
					dto = frameList.get(0);
					bean.setStandCharge(dto.getCaculateFee());
				} else {
					throw new WaybillValidateException(i18n.get("foss.gui.changing.waybillImportAction.exception.nullPackingVolumeFee"));
				}
			} else {
				throw new WaybillValidateException(i18n.get("foss.gui.changing.waybillImportAction.exception.nullPackingVolumeFee"));
			}
		}
	}

	/**
	 * 
	 * 打木箱费用
	 * 
	 * @author 025000-FOSS-helong
	 * @date 2012-11-30 下午03:29:21
	 */
	private void getBoxCharge(WaybillInfoVo bean) {
		ValueAddDto dto = new ValueAddDto();
		if (bean.getBoxGoodsNum()!=null && bean.getBoxGoodsNum() > 0) {
			// 打木箱
			List<ValueAddDto> boxList = rfcService
					.queryValueAddPriceList(getQueryYokeParam(bean,
							DictionaryValueConstants.PACKAGE_TYPE__BOX,
							bean.getBoxGoodsVolume()));

			if (boxList != null) {
				if (!boxList.isEmpty()) {
					dto = boxList.get(0);
					bean.setBoxCharge(dto.getCaculateFee());
				} else {
					throw new WaybillValidateException(i18n.get("foss.gui.changing.waybillImportAction.exception.nullPackingBoxFee"));
				}
			} else {
				throw new WaybillValidateException(i18n.get("foss.gui.changing.waybillImportAction.exception.nullPackingBoxFee"));
			}
		}
	}

	/**
	 * 
	 * 获取查询参数
	 * 
	 * @author 025000-FOSS-helong
	 * @date 2012-11-16 上午11:02:10
	 */
	private QueryBillCacilateValueAddDto getQueryYokeParam(WaybillInfoVo bean,
			String subType, BigDecimal volume) {
		QueryBillCacilateValueAddDto queryDto = new QueryBillCacilateValueAddDto();
		queryDto.setOriginalOrgCode(bean.getReceiveOrgCode());// 出发部门CODE
		queryDto.setDestinationOrgCode(bean.getCustomerPickupOrgCode()
				.getCode());// 到达部门CODE
		queryDto.setProductCode(bean.getProductCode().getCode());// 产品CODE
		queryDto.setGoodsTypeCode(null);// 货物类型CODE
		queryDto.setReceiveDate(bean.getBillTime());// 营业部收货日期（可选，无则表示当前日期）
		queryDto.setWeight(bean.getGoodsWeightTotal());// 重量
		queryDto.setVolume(volume);// 体积
		queryDto.setOriginnalCost(null);// 原始费用
		queryDto.setFlightShift(null);// 航班号、
		
		queryDto.setSubType(subType);// 为费用类型名称（综合信息费，燃油附加费，中转费等）
		
		queryDto.setLongOrShort(bean.getLongOrShort());// 长途 还是短途
		queryDto.setSubType(subType);// 为费用类型名称（综合信息费，燃油附加费，中转费等）
		queryDto.setCurrencyCdoe(FossConstants.CURRENCY_CODE_RMB);// 币种
		queryDto.setPricingEntryCode(PriceEntityConstants.PRICING_CODE_BZ);// 计价条目CODE
		queryDto.setPricingEntryName(null);// 计价名称
		queryDto.setWaybillNo(bean.getWaybillNo());
		return queryDto;
	}

	/**
	 * 
	 * UI注入
	 * @author 102246-foss-shaohongliang
	 * @date 2012-12-24 下午4:48:26
	 * @see com.deppon.foss.framework.client.component.buttonaction.IButtonActionListener#setInjectUI(java.awt.Container)
	 */
	public void setInjectUI(WaybillRFCUI ui) {
		waybillRFCUI = ui;
	}
	/**
	 * dp-foss-dongjialing
	 * 225131
	 * 有事后折阶梯折扣合同不允许开装卸费
	 */
	private  boolean iSLtDiscountBackInfo(WaybillInfoVo bean) {
		List<CusLtDiscountItemDto> list = rfcService.queryLtDiscountBackInfo(bean.getDeliveryCustomerCode(), bean.getBillTime());
		if(null ==list || list.size()==0) {
			return true;
		}
		return false;
	}
}